{"site_name":"mersy note","description":null,"language":"en","site_url":"https://note.mersy418.com","update":"2018-05-03T01:38:13.720Z","generator":"hexo-generator-json-feed","webMaster":"mersy","items":[{"title":"Emacsキーバインドを試してみる","permalink":"https://note.mersy418.com/article/mac-keybind.html","text":"Google日本語入力をためしてみる | mersy notehttps://note.mersy418.com/article/blog-googleime.html 日本語入力を変えたことで、切り替えのショートカットも変わった。そのついでにEmacsキーバインドをなるべく使うようにしてみようかな、と。 ショートカットが変わると手が慣れるまで苦痛でしかないのだけれども、だったらその際に他のも取り入れてみてもいいのかなぁと。（ライブ変換がなくなるとそれはそれでなれるのに一苦労するけど） 矢印キーが小さくて上下間違える、とか些細な事もあったりしつつ。 この辺の記事をとりあえず参考に。 MacユーザーならEmacsキーバインドをマスターしよう – 株式会社キャパ CAPA,Inc.https://www.capa.co.jp/archives/6078テキスト入力が死ぬほどはかどるMacショートカットキー15個 | Find Job! Startuphttps://www.find-job.net/startup/mac-shortcut Keyboard MaestroでMacでのEmacsキーバインドを補完する - DTP Transithttp://www.dtp-transit.jp/apple/mac-os-x/post_2217.html文字編集を行う際に覚えておきたいcontrolキーを使ったキーボードショートカット - DTP Transithttp://www.dtp-transit.jp/apple/mac-os-x/post_1279.html Mac のキーボードショートカット - Apple サポートhttps://support.apple.com/ja-jp/HT201236 ショートカット 内容 Ctrl + f カーソル右 Ctrl + b カーソル左 Ctrl + n カーソル下 Ctrl + p カーソル上 Ctrl + a カーソル行頭 Ctrl + e カーソル行末 Ctrl + h カーソルの左文字を削除。BackSpace Ctrl + d カーソルの右文字を削除 Ctrl + k カーソルから右すべて切り取り うまく動いてなかったもの ショートカット 内容 Ctrl + o カーソルのあとに1行挿入 Keyboard Maestro はよさそうなんだけどアプリ入れることに若干抵抗があるからこれらに慣れたらまた検討、ってかんじかなぁ。 選択してコピーするときとかにショートカットおしながら、Shiftも押すってのが若干なれるまで時間かかりそうな気配がする。あとは使いながら手が慣れて覚えるようにしていくのみ。","date":"2018-05-02T22:00:00.000Z","guid":"https://note.mersy418.com/article/mac-keybind.html","category":"Blog"},{"title":"Google日本語入力をためしてみる","permalink":"https://note.mersy418.com/article/blog-googleime.html","text":"今更だけどMacのライブ変換に戻してみる | mersy notehttps://note.mersy418.com/article/mac-live-input.htmlライブ変換に変えてみてから一ヶ月たった | mersy notehttps://note.mersy418.com/article/blog-live-input-1month.html ライブ変換はいいかんじだとおもうのだけど、入れてる途中で消えちゃうことがあってなんだこれ、と。とはいえ、ライブ変換で変換を押すことがへってたので入力するときの変換がなれるかどうかがきになるところ、、、 やはり入力は音声の方がいいのか？ Google日本語入力にしてみるATOKにもどしてみるかとおもったのだけど、この際だしということで Google 日本語入力をためしてみることに。 Google 日本語入力 – Googlehttps://www.google.co.jp/ime/【アプリ】Mac標準の日本語入力がしっくりこなかったのでGoogle日本語入力に浮気してみたら良さそうだと思った件https://cyocopen.com/ime-google/ Ctrl + Shift + j =&gt; ひらがなCtrl + Shift + ; =&gt; 英字 となってるみたいなので、Cmd 1つよりはおおいけど、前後で入力をきりかえるよりはいいのかな、と。 Alfred の初期入力も英字にしておいてこれで少し試してみる。","date":"2018-05-01T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-googleime.html","category":"Blog"},{"title":"SuperDrive対応デバイス","permalink":"https://note.mersy418.com/article/apple-superdrive.html","text":"Amazon | TUNEWEAR ALMIGHTY DOCK C2 マルチUSB-Cハブ シルバー TUN-OT-000041 | TUNEWEAR | パソコン・周辺機器 通販https://www.amazon.co.jp/TUNEWEAR-ALMIGHTY-DOCK-%E3%83%9E%E3%83%AB%E3%83%81USB-C%E3%83%8F%E3%83%96-TUN-OT-000041/dp/B07BVRKLK6MacBookのUSB-Cポートを超拡張する「ALMIGHTY DOCK C2」HDMI、microSD、USB、有線LANなど何でも来い！https://ushigyu.net/2018/04/09/almighty-dock-c2/ ※ Apple USB SuperDriveなど、1A以上をバスパワーで必要とするデバイスには対応していません。 対応してないのかー。。。 最近、いくつかの機会で持ってるアダプタがうまく動かないということがあり、、、、他のにしてもいいのかなということも考えつつ。。。 SuperDrive が必要になる時ってのはそんなにないんだけど。単にデータを取る時だけならいいんだけど、設定用のDVDを読み込んでる時とかは、USB が足りなくて詰むってことがあったりするので。 ちょっと重くなるけど、次は MacBook Pro にしたほうがいいのかなぁ。。。Touch Bar はいらないけど。","date":"2018-04-29T22:00:00.000Z","guid":"https://note.mersy418.com/article/apple-superdrive.html","category":"Blog"},{"title":"blogの下書きは日本語タイトルにする運用で一旦回避","permalink":"https://note.mersy418.com/article/blog-draft-japanese.html","text":"ブログ書く環境・公開するところをどうするかあれこれ検討中 | mersy notehttps://note.mersy418.com/article/blog-writing.html 色々調べたり考えたりしているが、これといったものがなく。。。 ATOMのtree-viewを拡張するような感じで、front-matterのタイトルを表示されるとかできれば良さそうな気もしたけどそういうのをすぐ見つけられなかったので、であればとりあえずファイル名を日本語で書いておくのが早そうな気がしてきた。 いずれまたいいものがあればそれに変えればいいとして、とりあえずの運用スタイルとしては、下書き時点では日本語ファイル名にしておいて、公開する前にファイル名を変えるってのがいいんだろうな。 要するに運用で対応。","date":"2018-04-28T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-draft-japanese.html","category":"Blog"},{"title":"ブログ書く環境・公開するところをどうするかあれこれ検討中","permalink":"https://note.mersy418.com/article/blog-writing.html","text":"何となくブログを書く環境をどうにかしたい、と考えている。 Hexo を使うようになって、Atom （というかエディタ）で書くことがすごく楽なのでこれはいいな、と思っているところがある。ただ、下書きがたまりすぎてくるとどうにもわかりづらい、というのがあってそこをどうにかしたいな、、、と。ファイル名を日本語にしとけばいいんだろうけど。 何日もトライエラーして成果ゼロ・・・・ 要件 Markdown で書く mdファイルとして持っておける 画像類も特定のフォルダにまとめて登録しておける ってのが最低限のラインで、コンテンツのデータは別物として管理しておきたい、というところがある。後々の持ち運びしやすさを考えて。。。 これに 移行のことを考えると frontmatter の形式は維持しておきたい GUI っぽい画面で下書き一覧のタイトルが見れる ファイル名だけだと何を書こうとしてたかがすぐわからない そのGUIから編集・更新できたら良い 編集更新したデータは手元のmdをアップデートしたい できればサーバ管理とかしたくない という感じで考えている。 なんか開発すればいいんだろうなぁ、という気はするのだけれども。。。 色々調べてて出てきた案とか諸々 ulyssesなどのエディタとmedium, WPとか はてなブログとblogsync Gravのgitsyncプラグイン Static Site Generator のオンラインサービスっぽいもの forestry（Hugo&amp;Jekyll） HUGOで試した siteleaf（Jekyll） Netlify CMS ulyssesなどのエディタとmediumとかエディタからの一方通行でmedium上での編集を持ってこれなそう。 はてなブログとblogsyncなんかこけた。調べてたらAtomの拡張に似たようなのがあるっぽいので後で試してみる。だいぶ書き方変わりそうだけど。 GravのgitsyncプラグインGravのデータの持ち方がちょっと合わなかった。てか先に調べとけばわかった話。 forestryローカルのhugoからgithub経由で同期はできてるっぽい。が、なんかトップページとかのbuildがうまく動いていない。feedのxmlは問題なさそうだからなぁ。。。そこが解決できるとこれがなかなかいい線いってると思うんだけどな。。。 siteleafsiteleaf 上でまずjekyllのサイトを作ってそれをgithub経由で引っ張ってくる、という感じでやったのだけど、ローカルでエラーが出てうまくいかない。。。 次やるならまずローカルでjekyllのを立ち上げてsiteleafに取り込むというのがいいんだろうか。。。jekyllとhexoのファイル名ルールが違うので移行するとなるとその辺直さないとなので少々面倒。。。 Netlify CMSなんかローカルからあげる時とかの動作がちょっときになる。やりたいことは大体やれてる気がしないでもない。workflowっぽいのを入れれば下書き問題もクリアできてるみたいなところはある。 試してない hexo admin なんかscreenshotを見る限りはやりたいことができなさそう 若干ダサい hatena-blog-and-fotolife https://atom.io/packages/hatena-blog-and-fotolife なんか良さそう。どうだろう。 書き方が変わるのが少々気になる WordPressのgitsyncっぽいプラグイン WPを動かしとくのがちょっとな。 staticにしてどうこうやれるのかな。調べてみる。 MarsEdit, するぷろZとかのブログ用エディタ 昔使ってたけど、、、 mdファイルとしてデータを持っておけないか？連携先からダウンロードする、とかでもいいのかもしれない？？ mdとassetをgithub経由でMTとDataAPI連携する mdとassetをgithub経由にしつつflexibleSearchとmdのparserでサイトっぽくする contentfulとかと連携する データはcontentfulに持たせておいて、そこからデータを取り出すだけのSPA的なものを作ればいける？ なんか他に見つけたものとか Prose http://prose.io/ github上のmdファイルをオンラインで編集できるっぽい タイトルとかはないみたい？だからかもう少し オンラインからpublishはできるかも medium-upload https://atom.io/packages/medium-upload 良さそうだけど多分ファイル名をタイトルに使うっぽいのできついかもな。 Mediumで編集したものは引っ張ってこれないんだろな。 サーバ管理Grav とか試す時点でサーバ用意しないとなので、管理しない方法は諦める方向。。。 sync-syncsync-synchttps://atom.io/packages/sync-sync 動かず。 MWebMWeb - Pro Markdown writing, note taking and static blog generator App - MWebhttp://www.mweb.im/ なんか違う esaesaの記事を気軽かつ柔軟に外部公開するためのWebアプリ「esaba」 | QUARTETCOM TECH BLOGhttp://tech.quartetcom.co.jp/2017/11/02/lets-share-markdown-docs-via-esaba/esaba/README.ja.md at master · ttskch/esabahttps://github.com/ttskch/esaba/blob/master/README.ja.md","date":"2018-04-25T06:00:00.000Z","guid":"https://note.mersy418.com/article/blog-writing.html","category":"Blog"},{"title":"全部という言葉の曖昧さ","permalink":"https://note.mersy418.com/article/blog-whats-all.html","text":"自分でも使ってしまって反省することがあるのだけれども。「全部」とか「全て」、、、という言葉を使っての指示・連絡は大体にして伝わらないというか、認識ずれが起こる根源だと思う。 使う側は「全て対応した」「全てが対象」という感じで言いやすいところはあるのだけれども。 そこは頭の中で理解・イメージしてることが「全て」一致してれば問題ないとは思うのだけど。 なかなかそういう状況になる場面って少ないんじゃないかな、と。","date":"2018-04-16T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-whats-all.html","category":"Work"},{"title":"チケット管理のルール、チケットの掃除屋さん","permalink":"https://note.mersy418.com/article/blog-issue-rule.html","text":"cremaさんがセミナー？で話されてたスライドを拝見した。 フリーランスが出会う“現場のタスク管理法あれこれ”https://www.slideshare.net/cremacrema/ss-93090340 やっぱチケットのクローズルールとか整理とかしないとだよなー。やろうやろうやろう。。。。 お客さんもどういう風に使うのかある程度指針があったほうがいいんだろうしな。","date":"2018-04-15T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-issue-rule.html","category":"Work"},{"title":"橋本さんのトーク力がすごいなと思った","permalink":"https://note.mersy418.com/article/blog-talking.html","text":"出張ではお客さんと MTG をしたり、今回は先方の会社の人たちに自分たちの仕事の仕方の話とかそういう話をする機会があった。 機会があったといってもかなりの時間を橋本さんが話していて、僕もそれを聴く側に回っていたところもあったり（苦笑いい感じに割り込むとかしてみてもよかったかもな、、、というのは若干の反省。 かなりの時間（約二時間）を一人で話せるってのがすげーなー、とほんと思ってしまった。食事の時も飲み会の時もちょっとした時も、いろんなネタがポンポン出てくるし。 ネタがあるってのも大事だろうし、それを引き出せるってのも才能だろうな。普段からブログを書くとかで訓練してるってのもあるのだろうけど。 何もないところから会話をきりだせるっていうスキルが足りないとは思ってるだけに激しく尊敬。 まずはアウトプットして自分の言葉で語れることを意識的に行なっていきたいところ。","date":"2018-04-14T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-talking.html","category":"Blog"},{"title":"Safariメインにしたら少しは軽くなったような？気がする","permalink":"https://note.mersy418.com/article/blog-safari-main.html","text":"Safari に諸々寄せたから？かだいぶ軽くなった気がする。 メインブラウザを Firefox Developer Editon から Safari に切り替えてみる | mersy notehttps://note.mersy418.com/article/blog-which-browser.html 1Password の起動が早くなったというか引っかからなくなった気がする。 んじゃ、Firefox とか Chrome でもいいのかなー、という気がするけどどうだろうな。 時々複数ウィンドウ開いてるときに Safari が落ちてしまうことがあってそれはそれで困るのだけれど、マシンが重くなるということは減ったような気がする。。。今週仕事そんなにしてなかったってことかしら・・・ というかそれが理由なのではなくて、 Karabiner が理由だったのかも？しれないけど？？ Macbookキーボードの調子は相変わらず | mersy notehttps://note.mersy418.com/article/blog-macbook-keyboard-201804.html 日英の切り替えが変わっただけなのだけどショートカットが変わると慣れるまでほんとタイピングが遅くなる、、、切り替えに意識がいってしまってるのか普通の入力も引っ張られて遅くなってる気がする。今週は全然ダメでしたね。 あとはなんかライブ変換との相性が悪いのかいまいちスーッと入力できていない気がする。この辺も慣れなのかな。。。あまりになれなかったら一旦 ATOK にしてみるとかかな。 日本語入力してる時でも半角スペースをサクッと入力できる方法はないものかな。と調べてたら 半角スペースは Shift にスペースなのね。。。。今知った。。。 macOS Sierra で日本語 (かな) 入力時もデフォルトでスペースを半角にする方法の備忘録 | Rhttps://beadored.com/macos-sierra-japaneseim-half-width-space/macOS (High) Sierraで日本語入力時に常にスペースを半角に - Qiitahttps://qiita.com/on0z/items/a9b4033cc088627b1728","date":"2018-04-06T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-safari-main.html","category":"Blog"},{"title":"Macbookキーボードの調子は相変わらず","permalink":"https://note.mersy418.com/article/blog-macbook-keyboard-201804.html","text":"MacBookのキーボードが調子悪め〜その後20180308 | mersy notehttps://note.mersy418.com/article/blog-macbook-keyboard-20180308.html なんとも調子が良くなるという気はしないので、また掃除してみることにするかも。 キーがダブルだけじゃなくて、意図しない時にリターンが押されてる気もするので、ちょっとつらいなー、という時が時々。まだ事故にはなってないけど、、、、Backlogのコメントが途中で送られてしまったくらい。 バタフライキーボードで100万文字打ち込んだ僕の辛口レビュー | Apple信者１億人創出計画https://appleshinja.com/butterflykeyboard-review この辺読んでみるとキーボード自体の問題なのかなー。とりあえず、古い MacBookAir を一度クリーンインストールして、セットアップし直してみて、この MacBook を修理に出してみるかな。 ふと思いだしたので Apple のサポートに電話してみた。 Mac の NVRAM をリセットする方法 - Apple サポートhttps://support.apple.com/ja-jp/HT204063 この方法を教えてもらった。ということで試したけれども。。。 Mac 再起動して、すぐ、Safariのタブを切り替えようとすると、2,3個先まで行ってしまったりしていて、なかなかに困った感じ。 少し調べてみてたら Karabiner が関係してそう、みたいなブログも見つけた。 mac キーボードの入力で同じ文字が連続入力されてしまう件について - プログラマーのアプリ開発日誌http://d.hatena.ne.jp/nkawamura/20160103/1451834798 ここに書かれてる設定を見ても今のバージョンのにはなさそうで見つけられなかったのだけど。 その流れで Karabiner-Elements のログをみてるとここに書かれてるようなエラーみたいなのが結構出てた。 karabiner_grabber large CPU consumption on macbook · Issue #819 · tekezo/Karabiner-Elements · GitHubhttps://github.com/tekezo/Karabiner-Elements/issues/819 とりあえず、Karabiner-Elements を削除してみる。 再起動した感じでは特に先ほどのようなタブ切り替えが意図しない感じになる、ってのはなさそう。とはいえ、入力の切り替えのショートカットが変わることになるので、そこになれるまでが若干苦痛だ。。。 とりあえずこれで様子を見てみよう。。。","date":"2018-04-02T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-macbook-keyboard-201804.html","category":"Blog"},{"title":"個人的なタスク管理にTickTickを使い始めた。","permalink":"https://note.mersy418.com/article/blog-gtd-ticktick.html","text":"個人的なタスク管理に TickTick を使い始めた。 TickTickhttps://ticktick.com/ backlog や Asana に集約しようとしてたけど、なんかこうしっくりこないというか。 この際だからしばらくやっていなかった GTD 的なのも見直してみようかな、、と。その辺で調べていたらたまた TickTick を知った感じ。 とりあえず、色々どう使っていくか？というのを含めて自分用のメモも兼ねて書いておく。 GTD的なプロジェクトの概念は子タスクで対応することにしておく。子タスクが完了すると親もクローズするというのがいい感じなので。 リストにプロジェクト用のフォルダを作って、そこにプロジェクトをそれぞれリストとして入れたんだけど、そこに入ったタスクを見落としそうな気がするな、と。であれば複数ある作業をサブタスクにすれば問題なさそうな？ プロジェクトというリストにこの親タスクを入れておけばいいのかも？？ スケジュールをブロックする定期的にブロックしておきたいもの、は Todo っぽい感じではないので、とりあえず Google Calendar にカレンダーを１つ用意してそれを TickTick に読み込ませるようにした。これで、朝と夜は最低限ブロック。 あとは、バッファ部分を調整しておきたいところ。その上で、定期的にやりたいことをある程度固定しておきたいところ。 この辺は『1440分の使い方』の話に近いところ。 んで、これをやるためには寝坊をしないことが重要。朝は苦手ではないけど、酒を飲んでしまうとさすがに起きれない日があるので、そこはやめるなりしていかないとだなー。 何が本当に大事なのか？個人的に大事だと思っていること。関わっているチームにとって自分がやらないといけないこと。 メール＞inboxのタイミング1日のほとんどはメールを見ている時間が多いのだけど。メールを返したり、 Backlog の通知メールを見て、 Backlog で返事するとかステータスを変更するとか。 そのメールもすぐ返信できるならすぐ返信する。すぐ返信できなさそうな内容なら、 inbox\u0010\u0010 にとりあえず入れておいて、あとで振り分けるとかすればいいんだろうな。 多分この辺の処理が追いつけていなくて、キャパ超えてるとか思っていたのかもしれない。 reviewのタイミングreview をどこのタイミングでやるのが自分の中で適切なのか？は少し考えて見たいところ。夜がいいんだろうけど。 合わせて翌日の Todo の整理とかも。できる限りこの辺は業務時間の最後にやれればいいんだろうけど、うまいこといれられるかなー。あとは、週末をどうしようか？というのがちょっとあるな。 Arrange Task が良さそうな？Arrange Task がなかなかいい感じのような気がする。キャプチャがないとわかりづらいところだけど。 Inbox から振り分けたものを、いつやるか？という感じでカレンダーに割り振っていけばいいんだろうな。 基本的にやることは TickTick の Calendar をみてそこで進めていくようにしようかな、と。 繰り返しでやりたい同じことのリスト（プロジェクト）をどうセットするか？毎週、火・木のどこかでやりたいのだが、時間をセットしたrepeatにしてしまうと、次のものも時間が動くので動かしづらい。翌日以降のTodoを前日とかに調整する、という方針にすれば一応大丈夫かも？重なってるところはとりあえずスルーするとして。 状況として何を確認したいか？からどういうリスト分け、タグ付けを考えてもいいかもしれない。この辺は使いながらもう少し精査してみる。 いつやる？は TickTick での Due Date を使うことにした。そのやらないといけないこと自体の期日は #_YYYYMMDD でタグで管理することにしてみる。 その上で、日々の振り返りの中で、この日付でフィルタをかけるとかして、振り返られるようにしたいな、とは思っている。 スケジュール表にTodoを組み込むけど、 Slack とかでの確認のやりとりは優先事項で対応する。やらないと行けないことがもちろん大事だけれども、チームの進行が滞りなく進むようにすることも非常に大事なので。","date":"2018-03-30T04:22:18.000Z","guid":"https://note.mersy418.com/article/blog-gtd-ticktick.html","category":"Blog"},{"title":"会社も大事だけど個も立っていく必要があるのではないか、と思うこと","permalink":"https://note.mersy418.com/article/blog-publish-person.html","text":"これらを読んでいて、ちょうど似たようなことを考えていたなー、と。 オンラインとオフラインにおける「自分」の多面性を考える｜加藤 綾(あやにー)｜notehttps://note.mu/ayaniememo/n/nf06555988ed6オンラインのコミュニケーションが上手くないと、負ける社会がやって来た | Books&amp;Appshttps://blog.tinect.jp/?p=49499 bit part のブログは、メンバーのブログのハブのような感じにしようかな、と思っていた（絶賛調整中）。その方が各自のモチベーションにも繋がるだろうし、そもそも会社の枠にとどめておく必要はないんじゃないのかな、と。 営業目的だけではないにしてもイベントに参加するとか色々、個々人がやってることってのは巡り巡って会社につながってくることもあるし、個人にとってもメリットがあるわけだし。 アイ・ペアーズだと皆川さんの YouTube Channel や林さんの個人ページ。 Taichi Minagawa Channelhttps://www.youtube.com/channel/UC-6KPNfax0lguukdFBAJzkw林みゆき オフィシャルサイトhttps://i-pairs.co.jp/miyuki-hayashi/ 音楽事業としてはアイ・ペアーズでももちろんやってるわけだけど、こうやって顔が見えているのもいいことなんじゃないのかなぁ、と。 言問だと開発チームの面々は外に出てる人もいればそうじゃない人もいるけど、大体がみんなすごい感じで。藤田さんなんかは CMS といえば？な感じで動いていたりするし（すごいところはそれだけじゃないんだけど）。 個人的な経験だと、xxxというお店のパスタが美味しかったのだけど、シェフが異動？退職？してしまった。残念だけど、そのシェフはどこにいってしまったのだろう？？とか気になって仕方ない。 さすがにお店で誰が料理してるかまでを把握するのは難しいかもしれないけど、ブログとかで探すことはできるかもしれないし。。。 属人性が高いといえばそういう面もあるのかもしれないけど。ファンっていうのが近い感じのイメージになるのかなー。 会社名やサービス名を求めている場合や、信頼に繋がる場合ももちろんあるんだけど、こんな感じで個人ももっと目立っていけるような感じで進めていければいいなぁとなんとなく思っていたりします。 こういうことをやってる人たちがいるってのも大事ですよね。メンバーに恵まれて仕事をできているな、ということを改めて感じます。","date":"2018-03-27T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-publish-person.html","category":"Blog"},{"title":"案件スタート時に開発メンバーでの音声会議をやってみてもいいのかもしれない","permalink":"https://note.mersy418.com/article/blog-team-kickoff-meeting.html","text":"オンラインの音声会議をストレスなくやりたい | mersy notehttps://note.mersy418.com/article/blog-online-meeting-sound.html を書いたら @tinybeans から「案件のスタートする前とかに、ビデオ会議とかすると良さそうと思うことがる」というフィードバックをもらった。 なるほど、と。 自分は打ち合わせに参加する側だから気づいてないところもありそうだけど、開発する側からだと一度そういう場を設けて、認識の統一をはかっておけると、あとあと進めやすいところはあるんだろうな。 以前の案件では、開発入る前の MTG でリモートの開発メンバーにもオンラインで音声会議に入ってもらったりして、 MTG の状況を共有したりもしてた。 そういった感じのことをやっておいたほうが、後々の進め方とか、判断が必要な時のジャッジがしやすくなるとかがあるのかもしれないなー。 リモートワークは難しい / Developer Summit 2018 // Speaker Deckhttps://speakerdeck.com/daiksy/developer-summit-2018 この辺に書かれてあるけど、コミュニケーション、情報や状況の共有をどうするか？というのがほんと大事で重要だと思う。 ビデオ会議とかで一度やっておくことで解決できることは多いのかもしれない。","date":"2018-03-26T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-team-kickoff-meeting.html","category":"Work"},{"title":"メインブラウザを Firefox Developer Editon から Safari に切り替えてみる","permalink":"https://note.mersy418.com/article/blog-which-browser.html","text":"ここ最近の取り組みとして、起動するアプリを減らして、なるべくブラウザに寄せるようにして PC が重くならないように、、、というのを試してみたりしてる。 使い方が悪いのかもしれないけど、すぐ Mac が重くなってしまうんだよなぁ。。。 メール周りは諸般の事情で、 Google アカウント以外も管理する必要があったので、 MailPlane から Rambox に変更して使ってきていた。 Ramboxを使い始めてみたhttps://note.mersy418.com/article/use-rambox.html ただ、若干メモリ食ってる感があったので、メインブラウザ（Firefox Developer Edition）に Gmail とかを開くようにしてピン留して試したりしていた。Firefox が軽くて早いと思っていたけど、タブを開きすぎたり、開いたタブをずっと放置してるとそれはそれで重くなるので、その辺は拡張入れて対応したりしていた。 Tab Suspender を使ってみるhttps://note.mersy418.com/article/blog-firefox-tabsuspend.html とはいえ Firefox だけにしててもなんか重いなー、という感じなので、ちょっとブラウザを Safari にしてみることにする。 Firefox にする前も Chrome から Safari に乗り換えたりしてたんだけど、なんでだったっけな。。。 週末触ってる感じだと、タブとかそこまで開いていないのも関係あるかもしれないけど、メモリ使ってる割にはサクサク開いてる気がする。 Safari もタブのピン留できるから Gmail, Google Calendar を複数アカウント開いてピン留しておいた。Safari はウィンドウ共通でピン留したタブが出るのね、なるほど。これは個人的にはちょっと余計かな。。。 Slack のアプリも重めだからこの辺もブラウザに持ってっても良いのかもなー。検索のショートカットがバッティングするところだけをどうにかしたい。 少し触った感じだとこれまでのことは問題なくできてるけど、できなさそうなことがあったりしてるので、その辺は調べつつなところもありそう。 とりあえず今週触ってみながらどうなるかを様子見かな。 普段全然気にしてなかったのだけど、自分の道具をメンテしてるような気が今更だけどしてきた（遅","date":"2018-03-25T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-which-browser.html","category":"Blog"},{"title":"テレビ会議に有効なTipsについての記事を読んだ","permalink":"https://note.mersy418.com/article/blog-tips-online-tvmeeting.html","text":"オンラインの音声会議をストレスなくやりたい | mersy notehttps://note.mersy418.com/article/blog-online-meeting-sound.html 昨日こんなことを書いてたら、参考になるテレビ会議のブログ記事を見つけた。 テレビ会議を劇的に円滑にする簡単なノウハウ | Social Change!https://kuranuki.sonicgarden.jp/2018/03/tv-meeting.html 普段やるときはあまり映像まで繋いでやってないんだけど、顔が見えてる方が伝わることもあるわけだしなぁ。 んで、 マイク付きイヤホンを使うこと これは確かにそうだなと思うから、できる限りそういうのを各自用意してやるようにしてもいいんだろうな。自分自身も直接 Mac のマイクとスピーカーだけだったので、今後は使うようにしてみようかな。 声に出して相槌をうつこと これなんかも確かにそうで、気をつけてないと自分も相槌打つの忘れるので、意識していかないとだなー。 オンラインドキュメントを共有しながらっていうのはやれてないから、そこは少しずつやるようにしていきたい気はする。これはオンラインMTGだけじゃなくて、実際のMTGとかでも当てはまる話だろうから、当たり前にやれるようにトライしていきたいなぁ。 ラジオ参加するときはフェイスをオフに 耳だけ参加してる時なんかは時々あったりするな。実際のMTGは全員が集まってやってるんだけど、リモートで耳だけ参加させてもらうような感じで。 MTGのあとで、全部共有してもらうよりも早い場合があったりするので、参考程度に耳だけ聞いてる、みたいな。 まぁ、このときは MTG してる側がそういったオンラインでの参加を想定していないので、マイクがなかったりとかでよく聞こえないことが多くてあまり参考にならなかったりすることもあるんだけどね。 オンライン会議、ビデオの方がいいかどうかとか今度みんなに聞いてみよう。テザリングとかだときついかなー？？","date":"2018-03-24T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-tips-online-tvmeeting.html","category":"blog"},{"title":"オンラインの音声会議をストレスなくやりたい","permalink":"https://note.mersy418.com/article/blog-online-meeting-sound.html","text":"オンラインで会議をする時の音声が聞こえにくかったり、途切れたりする問題。ビデオ繋ぐと重くなるだろうから、基本は音声に誰かの画面共有を共有するくらいでとりあえずはいいんだけど。 顔が見えた方が色々伝わるものもあったりはしそう。 マイクやスピーカーを置くことで解消することもありそう。ネットの回線だったり、社内ネットワークだったり。人数が複数対複数であればさらに難しさが増しそう。 自分とこのネットワーク、PCとか環境がよくないのかなー、と思うこともあるくらいストレスに思うこともあったり。Macが重くなってると回線とか以前にマシンが反応悪くなるからそれはそれで別な問題だろうけど。 そもそも、お互いにどのようなクオリティで聞こえているか？というのがわからないだけに難しい問題な気もする。 リモートでやる以上は最低限の設備は整えておかないとだなー。 使うツールツールとしてはSkypeがまぁまぁいいのかな、という気はする。appear.in とか slack call でもまぁいいのだけど。 appear.in – one click video conversationshttps://appear.in/ slackはアプリが重いのが個人的にはきついところ。appear.in は20分で一度画面共有が切れるところかな。 意外と電話がいいのか？そういう意味では電話の質って高いね。嫌いだけど。。。意外と音声だけなら、スマホで電話繋いでスピーカーにするとかでもいいのかもな？？電話つなぎっぱだと電話代怖いけど、カケホーダイ的なのとかでなんとか？ カケホーダイプラン（スマホ／タブ） | 料金・割引 | NTTドコモhttps://www.nttdocomo.co.jp/charge/new_plan/bill_plan/plan/kakeho/index.html なんかそれもいい考えのような気もしてきたり？？ 電話代がきになるなら、050の番号取ってやる感じのとかで繋ぐとか？？ SMARTalk（公式アプリ） | FUSION IP-Phone SMARThttps://ip-phone-smart.jp/smart/smartalk/ 前、NZと電話した時はそんなに問題なかった見たい。こっちが外でイヤホンとマイクで話してた感じでは、ちゃんと聞こえてたらしい。 なんか若干遅れてるかな、と思わなくもなかったけど。 テキストチャットが盛り上がってはいるけど、音声会議は無くせないし、この辺はいつでも対応できるようにしておきたい。お客さんともオンラインでやっても問題ないクオリティの構成とかを用意できればリモートでも安心してもらえそうな気がするなー。案件だと半年とかはあるわけなので、お客さんのところに機器を貸し出して置いておくとかもできるだろうし。","date":"2018-03-23T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-online-meeting-sound.html","category":"Blog"},{"title":"なぜそれを使うのか？みんなが使っているから","permalink":"https://note.mersy418.com/article/blog-why-use-because-you-use.html","text":"理由としては弱いだろうけど、みんなが使ってるのに揃えておくとメリットがあるという話。 わからなければ質問できる。何か引っかかったことがあれば共有できる。 タッチパネルの方が便利そうだからWindowsの方がいい気がするけど、みんなMacだからMacの方が楽そう。別にOSにそこまでこだわりはないし。Webサービスである程度賄えるだろうし。 とはいえ、Macにしかないソフトもあるしなー。逆もしかり。。。 そんなことを時々思うことはありますね。","date":"2018-03-22T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-why-use-because-you-use.html","category":"Blog"},{"title":"Webサイトを作ったなら保守・運用もセットで考えたいところ","permalink":"https://note.mersy418.com/article/blog-operations.html","text":"日本郵便がハード保守契約を全面見直し、ITベンダーの反発は必至 | 日経 xTECH（クロステック）http://tech.nikkeibp.co.jp/it/atcl/column/14/346926/012701285/ 保守にレベルがある話が書かれてあるのだけれども。これってウェブサイトにも似たような話があるような気がしていて。 落ちたら困るようなサイトであれば落ちてないかを 24/365 で監視した方がいいだろうし、何かあった時にそれに備える必要があるとは思う。 優先順位もつける必要はあるだろうけど、どこまでがサービスとして許容できる範囲で、どこからがNGなのか、を明確にした上で、どこまでを監視しして、保守する、そのための体制を作るのか？ということを考えておかないといけないんじゃないのかしら？ 検収ってなんだろう？っていう話にもなってくるところではあるが、そういうサイトを運用するつもりなのであれば、納品とかそんなこと言ってられない気もするし、そこからがスタートなわけで。 そこを踏まえて、開発から運用までを考えて構築していくのか？運用していくのか？制作をするにしても、もう少し広い目で見ていく必要があるんだろうなー。 と、以前からこのエントリをメモ的に書いておいて、今日公開しようとしてたところ、昨晩はそんな感じで障害対応があったりなんだり。。。そんなもんですよね。","date":"2018-03-21T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-operations.html","category":"Work"},{"title":"小さなことでも変化を楽しむ","permalink":"https://note.mersy418.com/article/blog-change-workspace.html","text":"先日、同じマンション内で引越しをした。ちょっとだけ広い部屋に。 仕事用のテーブルが、仕事用テーブルからダイニングテーブルに格上げ？になった。これに伴い、食事のたびにちゃんと片付ける必要が出てきた。 はてさて。慣れるまでが大変だけどどうなることやら。 とはいえ、些細なことでも変化は楽しむべきですね。ちょっとしたことでも習慣化できると色々変えていけますしね。","date":"2018-03-20T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-change-workspace.html","category":"Blog"},{"title":"特定のクレジットカードしか使えなかった近所のスーパー＞＞結局使えるようになりました","permalink":"https://note.mersy418.com/article/blog-cant-use-credit.html","text":"近所にスーパーができた。早速行ってきた。近所にある他のスーパーの中では広い方でいい感じ。 レジで判明。Tポイントのクレジットカードしか使えない。うちは持ってない。 VISAは使えるけどJCBは使えない、みたいなもんだと思えば納得するところもあるけど。 少々面倒だなー。 【Apple Pay】JALカード「Visa/Mastercard/TOKYU POINT ClubQ」が対応http://netafull.net/apple-pay/057070.htmlLINE Payを使って請求書支払ができる! わざわざコンビニ行かなくてもOKになるよ | [M] mbdb (モバデビ)https://mbdb.jp/it-news/linepay-bill-payment.html 全然興味がなかったのだけど、カードに縛られてるのもどうなんだろう？とか。 SEだと使えるの？レベルでわかってないけど、こういうのも少しずつ慣れていかないとなんだろうな。（使えないはずだから最新のにしてもいいけど、携帯も小さいのがいいなぁと思う派です。） 財布も携帯も無くす可能性があるだけに、なんとも不安だったりする。酒飲み過ぎなきゃいい話なんだけど。 とか書いていたら、オープン一週間で他のカードも使えるようになっていた。万歳。","date":"2018-03-20T21:00:00.000Z","guid":"https://note.mersy418.com/article/blog-cant-use-credit.html","category":"Blog"},{"title":"ツールを使ったら解決すると思うのが間違い","permalink":"https://note.mersy418.com/article/blog-tools.html","text":"ツールは便利で課題を解決してくれる可能性はあると思う。が、必ず解決してくれるわけでもないだろうし、あくまで道しるべの可能性もある。 またそのツールをどう使うか？でもぜんぜん変わる可能性もある。 ツールを使ったら万事解決といった思考停止状態で使っていては元々の課題解決も目的も達成できないんじゃないかな？ もう納期遅れからおさらば！プロジェクト管理ツールを厳選して10個紹介します | creivehttps://creive.me/archives/11931/ Backlog 使っているけど、xxxがきになるとかどうにかならないか？とか。そもそも期日に終わらなかったとか、仕様が変わった時に update をしにくくてどうする？とか全体が見通せない、とか。そこってツールが悪いんじゃなくて、使う人、運用する人の問題であるわけであって。 と言いつつ、他のツールとかなんかいいのないかなー、とかうろうろしつつ、Jira とか Wrike とかを使ったら解決するんじゃないか？ディレクターも楽になりつつ、メンバーもやりやすくなるんじゃないか？とかを考えることが多いこのごろ。単に、xxx を解決できてそうなツールという感じで見てるところはあるのだけど。そもそもツールじゃなくて、漏れなく共有できたり、わかりやすい方が重要だとは思うし。 あとは、依頼タスクをまとめるとかしたりも色々してみたり。試行錯誤でこの辺はチームの文化にもよるところがあると思うので、あったものを見つけられて、チームとして使っていけることをいとわないのが一番なのかなぁという気がしている。 と、なんだかんだ言って、ここのところなんとなく自分自身の管理方法とか進め方が上手いこといってない感があってどうしたものか？と悶々としてるわけです。","date":"2018-03-19T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-tools.html","category":"Blog"},{"title":"Alfredで乱数を取得できるようにしてみた","permalink":"https://note.mersy418.com/article/blog-alfred-random.html","text":"時々乱数がチャチャッと欲しくなる時があって。普段は 1password の password 生成を使ったりもしてるんですが、 1password をブラウザの拡張から開くときとかに若干時間がかかったりして、サクッといかなかったりしてた。 Slack でちょっと聞いてみたけど特にこれというのがなさそうだったので、試しに Alfred で作ってみた。作ってみた、といってもサンプルで用意されているものをカスタマイズしたり、 @tinybeans や @bun に作ってもらったものを参考にしたりした。 デフォルトで入ってる Snippet Tiggers あたりを参考にして。 コマンドは Alfreadのスニペットに乱数生成のコードを登録しておくと便利 - カメニッキhttp://tapira.hatenablog.com/entry/2015/12/12/194610 を参考にして10文字でとりあえず作ってみた。 cat /dev/urandom | LC_CTYPE=C tr -dc &#39;[:alnum:]&#39; | head -c 10 これで snippet とかで使える感じでいいかも。 登録後はこんな感じ。 スニペットの設定 キーワードの設定 スクリプトの設定 参考リンク Alfreadのスニペットに乱数生成のコードを登録しておくと便利 - カメニッキhttp://tapira.hatenablog.com/entry/2015/12/12/194610 Random String Generator | Packalhttp://www.packal.org/workflow/random-string-generator 静的サイトジェネレータで重複しないURLを生成するにはハッシュ関数を使えばよかった | 豆腐メンタルは崩れないhttps://wbtmiu.herokuapp.com/2014/10/20/25ac09b9aa7be35d476d17c9bff73a89/","date":"2018-03-18T21:00:00.000Z","guid":"https://note.mersy418.com/article/blog-alfred-random.html","category":"Blog"},{"title":"iPhoneのガラスフィルムを貼り直したら新品みたいになった","permalink":"https://note.mersy418.com/article/blog-iphone-screencover.html","text":"新しいのが出ても特に買い換えることなく iPhone SE を使ってますが。何回か落としたりして、ガラスフィルムの端から少しずつ欠け始めてきたり。それが少し指に引っかかったり刺さったりし始めてきて痛いのでまた同じのに買い換えた。 そもそも、ガラスフィルムはがしたことないな、、、ということでネットで見てみる。 ガラスフィルムは貼り方より「はがし方」が重要！ | 聴ききれない量の音楽と過ごす日々http://moremoremusic.net/how-to-taking-off-glass-film/ カッターがいるのね、、、と引越しの荷物に入れてしまっていて、しばらくはずせなかったり。 カッターで端っこからはがしていき、薄い紙の定期券を差し込んでいきながら少しずつはがしていった。途中ピキッてヒビが入る感じになったりしたけどゆっくりやっていってひとまず剥がすのは完了。 一応画面を綺麗に拭き直して貼り直し完了。 まるで新品みたい！ ちょうど橋本さんのブログでも似たような話が出てて。 iPhone8 Plusにつけていたゴリラガラスのフィルムが割れた！ | BridgeBook.JPhttps://bridgebook.jp/iphone8plus-glassfilm 今度はこっちでもいいかもなー。","date":"2018-03-17T21:00:00.000Z","guid":"https://note.mersy418.com/article/blog-iphone-screencover.html","category":"Blog"},{"title":"Togglの計測をSlackに通知してやってることを共有してみる","permalink":"https://note.mersy418.com/article/toggl2slack.html","text":"普段、各自が作業してる時とか今やってる backlog の issue の情報とかが Slack に投げられてて。ボタンつくったり、 Alfred から投げたりと、それぞれやりやすいようにカスタマイズしてやってるのだけど、個人的には Toggl でやりたいな、と。 Toggl - Time Tracker &amp; Employee Timesheet Softwarehttps://toggl.com/ 連絡とか確認が多いと対応する issue も多いからその辺は Toggl で計測してる方がひとまとめになっていいかな、、、と。 toggl2slack を使ってみるってことで調べてて、こちらを参考にさせてもらって動かしてみた。 Slackとtogglで頑張らない情報共有 - Diver Down技術ブログhttp://webken-tech.hatenablog.com/entry/2017/09/12/201647diverdown/toggl2slackhttps://github.com/diverdown/toggl2slack やることは書かれてる通りっちゃ通りなのだけど $ wget https://github.com/diverdown/toggl2slack/releases/download/v0.1.1/toggl2slack_0.1.1_linux_amd64.tar.gz $ tar zxfv toggl2slack_0.1.1_linux_amd64.tar.gz $ ./toggl2slack init $ vi config.json $ ./toggl2slack start config.json に設定する値とかはこんな感じで。 toggl_token : Toggl の Profile にある API tokendashboard_id : https://toggl.com/app/dashboard/me/AAAAAAAA/period/thisWeek みたいなURLの AAAAAAAA に当たるところwebhook_url : Slack の Webhook の URLTOGGL_USER1_ID : Toggl の userID &quot;users&quot;: { &quot;xxxxxx&quot;: { &quot;channel&quot;: &quot;#times_mersy&quot;, &quot;username&quot;: &quot;mersy&quot; } }, Toggl の userID がどこでわかるのかわからずだったのでhttps://github.com/toggl/toggl_api_docs/blob/master/chapters/workspace_users.mdを見て $ curl -v -u &lt;$toggl_token$&gt;:api_token -X GET https://www.toggl.com/api/v8/me こんな感じで投げて帰ってくるレスポンスにある id を使うことでいけた。 Terminal 閉じちゃうと終了しちゃうから ターミナルを閉じてもプロセスを終了させないnohupコマンド | 三度の飯とエレクトロンhttp://blog.katty.in/1434 を読んで $ nohup ./toggl2slack start こんな感じで動かしてみた。 Slack にも通知が来てるみたいで、これで晴れて仕事してるアピールができるようになりました。Toggl に WorkSpace が複数あると情報が別っぽいので、そこは別物とする必要がありそう。 サーバで動かせるようになるまでに @tinybeans と @bun に色々教えてもらいつつ、、、別の WorkSpace のを動かしてみたら今回はサクッといけました。感謝感謝。 参考リンクToggl toggl_api_docs/toggl_api.md at master · toggl/toggl_api_docshttps://github.com/toggl/toggl_api_docs/blob/master/toggl_api.md toririn/toggl_slackerhttps://github.com/toririn/toggl_slacker Togglを使って時間を意識した仕事をしようぜ！ - 大阪・兵庫・加古川 ホームページ制作のAWESOME | WEB・ホームページ制作、WEBマーケティング・SEO対策https://awe-some.net/2016/10/how-to-use-toggl/ 時間管理にTogglを使ってみたら想像以上によかった - dackdive’s bloghttp://dackdive.hateblo.jp/entry/2015/01/22/100000 Alfred to slack Alfred で作業時間を記録する workflow を作ってみた - たまに書くかもhttp://mame-neko.hatenablog.com/entry/2015/12/07/063407 fspinillo/slackfred: Interact with Slack via Alfredhttps://github.com/fspinillo/slackfred jason0x43/alfred-toggl: Alfred Workflow for interacting with the Toggl time tracking servicehttps://github.com/jason0x43/alfred-toggl","date":"2018-03-16T20:00:00.000Z","guid":"https://note.mersy418.com/article/toggl2slack.html","category":"Blog"},{"title":"コンビニでスマホアプリからプリントしてみた","permalink":"https://note.mersy418.com/article/blog-print-at-convenience.html","text":"引っ越したらルータとプリンタが遠くなったせいか、プリンタがうまいこと繋がらないのでコンビニプリントを試してみた。以前も一度オンライン経由のを試したことがある気がするけど。今回はスマホアプリ経由で試してみた。 うちの近所は ファミマなので、それ用のアプリをインストール。 コンビニでPrintSmash(プリントスマッシュ)/SHARPhttp://www.sharp.co.jp/multicopy/prsm/ メールに添付されていたPDFをアプリに送る。請求書は忘れる前に払わないと。。。 コンビニに着いたらコピー機が指定しているwifiに接続する。ここが一番時間かかったくらいで。 GmailのアプリからPDFファイルを PrintSmash へ送る。 プリント。終了。白黒で10円。 こりゃ楽だな。。。 あとは家から外へ出るめんどくささを乗り越えられれば、、、プリンタは捨ててもいいのかも？？しれない。今日はたまたま外出からの帰りだったし。というか繋がらないなら、一旦はプリンタはお別れかな。。。いやー、でも月末処理がめんどいんだよなー。。。悩ましい。","date":"2018-03-15T20:00:00.000Z","guid":"https://note.mersy418.com/article/blog-print-at-convenience.html","category":"blog"},{"title":"お持ち帰りで一枚無料になるドミノピザ","permalink":"https://note.mersy418.com/article/blog-domino-pizza.html","text":"ドミノピザの店舗受け取り、もう一枚半額というのを使ってみた。 知らないアナタは損してるかも？ お持ち帰りで２つのスペシャルオファー！｜ドミノ・ピザhttps://pizza.dominos.jp/ja/takeout/ 近所にドミノピザがあるのは知ってたけど、初めて使ってみた。 ご来店日時 2018年03月10日 19時17分受付日時 2018年03月10日 19時05分 ネットで注文して、準備して、取りに行くとできてる、くらいの勢い。最初何時に取りに行ったらいいのかわからず家を出たんだけど、メール見たら受け取り時間も書いてあってこれは安心。 これで、1枚はただとか大丈夫なのか心配にはなるけど。ピザには限定されるけど、外食しにいくより全然いいかも。","date":"2018-03-11T20:00:00.000Z","guid":"https://note.mersy418.com/article/blog-domino-pizza.html","category":"Blog"},{"title":"MacBookのキーボードが調子悪め〜その後20180308","permalink":"https://note.mersy418.com/article/blog-macbook-keyboard-20180308.html","text":"Macbook のキーボードの調子が悪いって話は先日かきまして。 MacBookのキーボードが調子悪め | mersy notehttps://note.mersy418.com/article/blog-macbook-keyboard.html この時試して調子良くなったかなー、と思ったりしてますが、さっきも少しダブったりしてた。うむむ。。。 とはいえ、頻度は減った気がする。 Tab Suspender を使ってみる | mersy notehttps://note.mersy418.com/article/blog-firefox-tabsuspend.html のおかげで Mac がそこまで重くなってないからなのかな。。。 そういうのに関係はあるんだろうか？？また少し様子見してみるか。","date":"2018-03-07T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-macbook-keyboard-20180308.html","category":"Blog"},{"title":"Tab Suspender を使ってみる","permalink":"https://note.mersy418.com/article/blog-firefox-tabsuspend.html","text":"Firefox Developer Edition をメインブラウザにしてみてます。 Firefox Developer Editionhttps://www.mozilla.org/ja/firefox/developer/ ブラウザのせいというよりは使い方なのかもしれないけれども、そこまで早いと感じることはなかったりもしつつ、Addon とかのせいなのかなぁということも考えたりしつつ、使ってます。チーム内はChromeが多いし、ブラウザ変えておけば勝手にブラウザチェック的にもなるかな、とか。。。 さすがにタブ開きすぎたり、開いて放置してると重いなぁ、、、と。Mac自体がかなり重くなるので、ちょっと検討してみるかということで、Slack に投げたら @tinybeans は Chrome で Great Suspender というのを使っているということで似たようなのを探してみたら Tab Suspender というのがあった。 Tab Suspenderhttps://addons.mozilla.org/ja/firefox/addon/tab-suspender-tab-unloader/ ってことで、入れて本日で2日目。昨日はあまり気にならなかったなー、、、という気がしてます。あまり仕事をしなかったのか・・・？？もしれないので今日明日また様子見です。 Suspend されるとこんな感じの画面になって、どこかクリックすればまた復旧します。 最初この画面が人の顔に見えてたんですが、よくみるとコーヒーとかそんな感じっぽいですね。","date":"2018-03-06T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-firefox-tabsuspend.html","category":"Blog"},{"title":"MacBookのキーボードが調子悪め","permalink":"https://note.mersy418.com/article/blog-macbook-keyboard.html","text":"MacBook のキーボードがなんか連打される感じになってて非常に辛い感じだったので、以下のを試してみた。 MacBook Pro 2016のキーボードが不調だったけどAppleサポートに電話したら直りました！ - 理系男子のぐうの音http://www.gu-none.com/entry/MacbookPro/17/supportMac の SMC (システム管理コントローラ) をリセットする方法 - Apple サポートhttps://support.apple.com/ja-jp/HT201295 これで快適になってくれるといいのだけど、、、、あまり期待できないかなー。","date":"2018-03-05T23:00:00.000Z","guid":"https://note.mersy418.com/article/blog-macbook-keyboard.html","category":"Blog"},{"title":"何がバグ？それをどういう風に伝えると色々ハッピーなんだろう？？","permalink":"https://note.mersy418.com/article/blog-what-bug.html","text":"提案：エンジニアに気軽に「バグ」というのはやめませんか？ - worker experienceの日記http://workerexperience.hatenablog.com/entry/2018/02/28/205329 個人的には意識して言わないようにはしてるつもりではあるけども。。。どうだろうな。。。 バグの前として、チーム内だと仕様をちゃんと伝え切れたかどうか？といったことも影響するだろうし。 結構クライアントからは不具合とか言われることがあるのでそこは許容しつつ、、、お客さんも意識して言ってるというより、他の言葉を知らない可能性もあるだろうし、クライアントからしたら期待したものになっていない、というからそう言ってしまうこともあるわけで。 何か言い方のルールとか考えた方がいいんだろうなー。 不具合報告とかも、不具合です！とか言われるだけでは特に意味のある報告でもないからそこから不具合を解消するためには、確認とか色々増えてくるわけであって。どこで何がどう不具合を思ったのか？これも双方でのコミュニケーションだったり信頼感とかの話な感じですね。 結局、信頼感が築けてなければ、バグ、瑕疵と言われ続けるだけな気もするし。 そもそも、勘違いでバグとか言ってる人はこの先変わらないだろうから、それは勝手に置換するように考えないと精神的には持たないだろうな、とは思うな。","date":"2018-03-04T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-what-bug.html","category":"Blog"},{"title":"Movable Type 7 のベータが出ました","permalink":"https://note.mersy418.com/article/blog-mt7-beta.html","text":"Movable Type 7 のベータが出ましたね。 Movable Type 7 ベータ版 リリースノート - Movable Type リリースノートhttps://movabletype.jp/release-notes/70beta.html コンテンツタイプが大きいところで楽しみなところではありますね。DataAPI 周りも機能追加されてるみたいだし。 さて、これに MTAppjQuery ではどんなことやっていきますかね。 MT7 スタイルガイド : MT7 Styleguidehttps://movabletype.github.io/mt7-style-guide/ とりあえずはスタイルガイドをざっと眺めて、どんなものになるかをイメージしつつ、こんなのできたらいいかなぁとか考えてるとワクワクしてきますね。","date":"2018-03-03T08:30:00.000Z","guid":"https://note.mersy418.com/article/blog-mt7-beta.html","category":"Blog"},{"title":"スモールスタートで運用しながら調整・成長していく","permalink":"https://note.mersy418.com/article/website-operation.html","text":"SAP推しだった親会社を説得し、kintoneで業務改善した会社の話 （アスキー） - Yahoo!ニュースhttps://headlines.yahoo.co.jp/hl?a=20180214-00000005-ascii-sci 運用しないと、触らないと、見えてこないこともあるわけで。小さくスタートはスタートするからこそ整って来ることもあるし、判断材料も出て来るわけで。100%完璧に全てを最初に洗い出すことは難しいわけだし、それができないという前提でどこまでやるかを決め、その上で運用しながら改善なり改修をしていく。 そういったことの繰り返しで、Webサイトもビジネスの一翼を担うのであれば同じような位置付けで取り組んでいかないと意味のないものになってしまう。作る側も依頼する側も作って終わりだとは思ってないだろうし、そこからがスタートと理解してるからこそ、どのように運用、保守をしてサイトを育てビジネスに繋げていくかを考えるという前提がないとまずいんじゃないだろうか？ コンテンツを蓄えてそれをどのように見せていくか。コンテンツが蓄えられたからこそ、それをどのように展開していくか？を考えられる。コンテンツを蓄えるなかでこうしたいという要望や、ここが使いづらいという改善要望も上がって来る。ユーザのFBやアクセス数から見えてくることもあるかもしれない。そういったものを繰り返しながらより良いものになっていくんじゃないだろうか？ そうなって来ると内部で人を抱えて作る方がいいのか？外部と連携して作るのがいいのか？という話にも繋がるんだろうな、とは思う。 Webサイト使ってビジネスするならそのあたりを考えておかないとビジネスも成功しないんじゃないのかなぁ。CMSを使ったWebサイトを提供する側としても最初の時点でしっかりとしたものを提供はしていくけど、そういった変化にも柔軟に対応する必要があることを忘れないようしないとなぁと思うわけです。","date":"2018-02-28T22:00:00.000Z","guid":"https://note.mersy418.com/article/website-operation.html","category":"Blog"},{"title":"Pageprooferというフィードバックサービス","permalink":"https://note.mersy418.com/article/webservice-pageproofer.html","text":"そうそう、こういうサービス作ってみたいなと思ってたんだよねー、というのをたまたま見つけた。 【すべてのWeb制作者に伝えたい】Webサイトのフィードバック・チェックツール Pageproofer | GrowGroup株式会社 名古屋・東京を拠点とするDTP・Webサイト(ホームページ)の制作会社https://grow-group.jp/archives/2498/ Pageproofer - Visual Bug Tracker &amp; Visual Feedback Toolhttps://pageproofer.com/ どっちかというと製作者とお客さんで利用するのが主目的になっていそうではあるけど。 サイトに埋め込んでおいて、データが溜まってサイトホルダーが見たければお金払う、みたいな流れを考えてた。どうでもいいコメントとか、嫌がらせがたまりそうだけど。。。 1ユーザとしてサイトを見ていて、これがあればなー、とかを簡単にFBしたり、要望を投げたり。そういうことでいい感じでサイトが便利になってくれればいいなぁという思いで。まぁ、そう簡単にはいかないんだろうけどね。 いやー、普段の視野が狭かったなぁと反省。","date":"2018-02-27T22:00:00.000Z","guid":"https://note.mersy418.com/article/webservice-pageproofer.html","category":"Blog"},{"title":"Markdownなドキュメントベースで開発するフローを考える","permalink":"https://note.mersy418.com/article/markdown-driven.html","text":"設計や仕様を Markdown ファイルで書いてgitに入れるか、wikiに入れるか。最近の webservice だと mdファイル自体はそこそこ読みやすくしてくれる気がしつつ。 mdファイルを開発側だけで触るのであればgit管理でもいいかもしれないけれども。。。お客さんとかも触るのであれば Dropbox Paper とかオンラインの方に寄せてもいいのかもしれない。まぁ、これもbitbucket上で編集してもらう、とかでもいいかもだけど、wiki とかの方が楽といえば楽だろうしな。最近 Backlog の Git を使うようにしたけど、 Backlog 上では編集できないしなぁ。 やっぱりリポジトリは外部サービスの方が使い勝手がいい気もしてくるな。 Git管理しつつ、特定のフォルダのmdファイルの内容については API 経由で wiki を更新するとかもありなのかなぁ。。管理画面から編集した時が面倒か。。。。と調べてたらなんか面白そうなものを見つけた。 ドキュメント管理の将来設計 - Qiitahttps://qiita.com/tearoom6/items/9518195fcd92bb87b9d0 Git で管理してコミットもしておきつつ、 wiki に投げられるならありかなー。 あとは検索の問題があるか。Bitbucket だと一応リポジトリ内の検索はできる。コードも一緒に検索されてくるからそれがいいのか悪いのかはありそう。Dropbox Paper だとフォルダ内検索っぽい機能はないのかな、、、見た感じ。スマホとかでも見れるとかも判断材料にはなりそう。 仕様を設計書などに書きつつ、それを見ればすべてわかるようにしておくそこを起点に開発し、テストをする。 開発中に変更が入れば、設計書を変更してそれをプルリク先に作ってチケット起票して依頼するような進め方にすれば、仕様の変更箇所と開発のチケット＆コミットまで結びつけられるんじゃなかろうか？先にテスト書いて開発する感じや、先に機能単位のプルリク作ってから開発するような。 実装中に常にドキュメント類をアップデートしていけばそういった問題は発生しないのだけど、どうしても後手になってしまって最後に差分が出る、という話になりがち。 コードからドキュメント作るっていう方法もあるけど、それは少し別の話になるかな、、、という気もしつつ。その場合は内容的にプログラムを解説する解説書に近いものが出来上がる気はしているので。とはいえ、初めてコード見る人にはあってもいいとおもうので、それはそれとして自動生成できるようにしておくと強い気はする。 バグは仕方ないにしても、仕様変更や修正などはドキュメントのアップデートを忘れないように、アップデート自体も1タスクくらいのつもりでいてもいいのかもしれないなー Adobe XDデザインスペックの使い方と、開発者と効率的に連携するヒント – Adobe Creative Stationhttps://blogs.adobe.com/creativestation/web-design-specifications-speeding-design-development-workflow-improving-productivity やりたいのは結局 XD が考えてる方向と近そうな気はするのだけど。どこに重きをおくかと、 XD はワイヤ〜デザイン〜フロントエンド、くらいまでは良さそうな気がするのだけど、CMSを使うときにどの情報を使うかを持たせられないのが若干辛いかな、と。 CMSのデータの持ち方自体はビジュアルとかあまり関係ないから別資料になるわけなので、そのデータをどこにどう見せるか？を必要になるのは、HTMLとCMS のテンプレートを作るタイミングになる訳なので、どちらかというとフロント側の設計書に寄せたいところではある。 結局は Markdown じゃなくてもよくて、チーム内でストレスなくわかりやすい形で共有できる何かができてスムーズに開発できればOKってことで。","date":"2018-02-26T21:00:00.000Z","guid":"https://note.mersy418.com/article/markdown-driven.html","category":"Direction"},{"title":"「モジュール一覧」でイメージが伝わっているんだろうか？","permalink":"https://note.mersy418.com/article/blog-word-module.html","text":"スタイルガイド的なものも作りつつ、モジュール一覧を作ってワイヤーを決めて必要なページのデザインを起こして実装を進めます。という感じで話をすることがあるのだけれども。 それのイメージはお客さんに伝わっているのか？というのが時々気になることがある。少し想像力を働かせないと、、、というところがあるし、そもそも制作会社とかによっても伝えたいと思ってる内容が違う気もするし。 まぁ、そういったものもプロトタイプツールを使うことでもう少しイメージ伝わりやすくなるんだろうとは思うのだけど。紙に出力したワイヤーだけだと伝わってない可能性はあるんだろうなぁ。 この辺はディレクションする側だけでなく、チームとしての制作の流れも関係してきそうだから普段からどうやったらよく進められるかとか議論して改善したり、新しいことを取り込んでいけるようになるといいんだろうな。","date":"2018-02-26T07:00:00.000Z","guid":"https://note.mersy418.com/article/blog-word-module.html","category":"Work"},{"title":"Backlog World に参加してきた","permalink":"https://note.mersy418.com/article/blog-backlog-world.html","text":"先週Backlog World に参加してきた。 Backlog World | プロジェクト管理に関わる全ての方のための祭典https://backlog.com/ja/backlog-world/ 2会場で進んでたのでどれ聞くか非常に悩んだけど、聞いたのはこの辺。 10:00〜 : 基調講演 10:50〜 : すれ違いを無くすためにSUUMOでやった事 11:30〜 : BacklogとTypetalkでリモートワークを快適にする方法 12:10〜 : レガシーな新聞社が本気でテクノロジーメディアを目指す開発プロジェクト 13:30〜 : アジャイル開発とプロジェクト管理ツールの相性 14:10〜 : サーバーワークスが語る BacklogでAWS導入プロジェクトが捗る3つの理由 14:50〜 : “プロジェクト管理”の前に考えること 15:30〜 : Web制作のプロジェクト管理についてぶっちゃけ話をしてみよう 基調講演今後のBacklogの話とか聞きたかったかもなー。どっかにのってそうだけど。 すれ違いを無くすためにSUUMOでやった事内容についてはSNS投稿禁止とのこと。 BacklogとTypetalkでリモートワークを快適にする方法bit part も言問もリモートなのでどんな感じか気になったので。 スライドが公開されてた。 [#BacklogWorld]BacklogとTypetalkでリモートワークを快適にする方法 // Speaker Deckhttps://speakerdeck.com/digitalcube/number-backlogworld-backlogtotypetalkterimotowakuwokuai-shi-nisurufang-fa この記事も様子がわかるとのことで読んでみた。 ASCII.jp：神戸のデジタルキューブが実践するコミュニティ、ビール、たまに仕事 (1/3)http://ascii.jp/elem/000/001/512/1512561/ リモートワークのコミュニケーションは難しいってのはどこも感じてるところでもあるっぽいな、とこれまで使われていたツールの紹介を見ながら。Backlogのコメントも悪くはないが、それはチャットでやったほうがいいんだろうなぁ、というのは感じつつ。slackでやったことを簡単にBacklogにも残しておくということができるといい気もする。Typetalk は使っていないからなんともわからないけど、Backlogに連携というところに限定すれば使いやすいのかもなー。 Customer Messaging Platform | Intercomhttps://www.intercom.com/ 初めて見た。なるほど。 クライアントさんとのやりとりにBacklog使ってるけど、それに合わせてクライアントさんとのチャットっぽいのにTypeTalkを導入するとかできないかなぁ、とは思ったりもした。料金体系的に難しそうではあるけど。 LogRocket | Logging and Session Replay for JavaScript Appshttps://logrocket.com/ これも後で見てみる。 レガシーな新聞社が本気でテクノロジーメディアを目指す開発プロジェクト速さが命。ほんと。開発体制を変えて兼任しないようにしたとか、チームの作り方を参考にしたいとも思ったけど、ちょっとリソース的にきついところがあるなぁ、とも。 Excelで管理するとタスクの見える化ができない話。ほんと。とはいえ、一覧化したいというか、上流の人の仕事はそれなので、Backlogでそれをしやすいようにしてあげる必要もあるんだろうなぁ、と。ExportしたCSVを見やすい形にするようなのを自動で作るとか。 スケジュールの元々の予定と、変更したものをbacklogでは追いづらいという話も。そうなのよねー。この辺どうするか？ってのは考えてるけどうまいこといかない。タスクの見える化と上流の話にも近いのだけど、受託とかだとスケジュールはまず最初に切って、お客さんに見てもらってという感じで、別のツールとかでの管理に移るだけに連携がしづらいところはある。 予定と実績の管理をbacklogで管理しづらいというところはあまり予定というか見込みまでBacklogで管理してなかったけど。実働は何かツール使って計測しつつそれらをマージして閲覧できるようなサービスを使うとか探して見てもいいのかもなぁ。 アジャイル開発とプロジェクト管理ツールの相性アジャイルの話。色々勉強になったし、この領域をもっと深く知ろうと思った。 ドキュメントや画面設計書を渡されても本気で見てもらえないだろうから、であれば少しでも動くものを元に話を進める。まぁ、手戻りも含めてって感じなんだろうけど、それらを踏まえての進め方をしていけばいいんだろうな。CMS開発だとプロトタイプ作って、管理画面も表側も両方見てもらう、という感じで。それを見てもらいつつ、振り返りをして、調整していくような進め方。プロト作るとかは始めてるけど、その前には要件とあらかじめ固めないと、というところもあるのでどの程度固めるか、整理するかっていうところもありそう。 とりあえずこれを読む。 われわれはなぜアジャイルに向かうのかhttps://www.slideshare.net/papanda/ss-79465986 変化を味方につける、という考え方も参考になった。なるほどなるほど。 タックマンモデルっていう言葉を知った。 タックマンモデルとは | チームビルディングLab.https://learningthroughdoing.jp/tuckmans_stages 後で調べる。 リモートではなく一緒の場でという感じなので、受け入れられないところもあるけど、色々と考えたいことが多かったので、自分のメモを再度見直しつつ、それを今の体制にどう取り入れていくかを考えたい。リモートだからできてない、では理由にならない。 サーバーワークスが語る BacklogでAWS導入プロジェクトが捗る3つの理由Backlog含めて色々なことを自動化する感じにされていてすごいな、と思った。 Questetra : 自動処理やAPI連携に対応するクラウド型ワークフローhttps://www.questetra.com/ja/ 使ったことないんだけど、使ってみようかな。 Yambdaのお話とかすごいなー、といくつかページ見つつ。 自由とけじめ ~AWS構築作業自動化プロジェクト「Yambda」開発の原動力とは？~ | 株式会社サーバーワークス’s Bloghttps://www.wantedly.com/companies/serverworks/employee_interviews/39347地道にAWS構築自動化に取り組んでいるお話し – サーバーワークスエンジニアブログhttp://blog.serverworks.co.jp/tech/2015/07/09/how_to_provision_aws_infrastructure_by_cloudformation/AWS環境を自動的にレビューする機能をリリースします – サーバーワークスエンジニアブログhttp://blog.serverworks.co.jp/tech/2016/05/31/releasing-configuration-review-feature/ AWS周りの設定とかその辺少し体制含めて見直したいところもあるので、こういったものを参考にさせてもらいたい。 Backlogのissueで色々やりとりした経緯をwikiにリンク貼っておくと、経緯を追える。なぜそういうことになったのかを知ることができる。背景、why を知ることができる。変更をそのまま実装することも問題ないが、背景を知ることでさらに良いものに繋げられる気がする。 issue起票の際にユーザストーリーベースで起票するといったことも近いのかもしれない。 “プロジェクト管理”の前に考えることジョージさんのお話。プロジェクトを完遂するためにツールを使う。ツールの使い方の策定をツールに合わせてまず決める。言葉遣いとか細かいところから。この辺は確かに決めないとツールの使い方が自体も結局めちゃくちゃになってしまってツールが機能しないこともあるなぁと改めて。ガチガチにしすぎるのも窮屈だけれども指針があった方がいいんだろうからその辺は取り入れていきたい。 そこまで細かくやる、考えるのねー、という感想。自分もまだまだやれること、やった方がいいことがあるな。 Backlogのissueについて注意喚起するプレイヤーを、と。確かに遅れてしまったり見落としてしまったり。そういうのやろうと年始早々思って、早二ヶ月。。。できてないなー。せめて週次でどうにかしたい。とりあえずこの辺はどうやったらいいんだろう？ってのを社内でも意見出し合って考えていきたいなぁと思っているところ。 PMやりたい人を増やすのもPMの仕事とおっしゃってた。PMやりたい人って少ないのかな？？ Web制作のプロジェクト管理についてぶっちゃけ話をしてみようこちら側窓口がなるべくbacklogに寄せるなり、メールしかなければ一覧表を作ってあげるなり。そういった配慮をしているところはやっていこうと思った。 メールだけで管理が大変だー、と思うことがあるだけにそういうのは一覧化した方がいいんだろうな。 Backlogを使ってこんな感じで案件進めます、ってのは整理して公開しておこうかな、と思った。社内的な使い方の整理もそうだし、ジョージさんのところであった使い方の話にも繋がるし。リモートだけどこんな感じで進めますよ、っていうのが伝えられるんだろうなぁ、と。 日曜なのでここで途中抜け。色々と考えるきっかけをもらったので、今のチームに合う感じで検討して取り入れていきたいなー、ということが多かった。","date":"2018-02-25T21:00:00.000Z","guid":"https://note.mersy418.com/article/blog-backlog-world.html","category":"Blog"},{"title":"MacBook のキーボードを掃除してみる","permalink":"https://note.mersy418.com/article/blog-mac-keyboard-cleaning.html","text":"なんか MacBook のキーボードがダブルクリックというか、連打される感じになってしまって困ってた。常に発生するわけではないからなんなんだろうな、、、 修理とかに出す余裕はないので、エアダスターとやらを買ってみて掃除してみた。 MacBook や MacBook Pro のキーボードのお手入れ方法 - Apple サポートhttps://support.apple.com/ja-jp/HT205662 果たしてこれで改善するのだろうか。。。そういや、時々returnキーが反応しない時もあるし、それも改善するといいな。 と、書いてる今は特に問題なさそうな気がする。。。","date":"2018-02-25T04:00:00.000Z","guid":"https://note.mersy418.com/article/blog-mac-keyboard-cleaning.html","category":"Blog"},{"title":"一応個人的に気をつけてる（つもりな）こと","permalink":"https://note.mersy418.com/article/blog-ux-for-member.html","text":"UXの社内勉強会で私が伝えたかった2つのこと｜Tsutomu Sogitani｜notehttps://note.mu/sogitani/n/na77e71d288cd を読んでいて、サンプルとして、以下のような話が出ていた。 Backlogを使っているあるプロジェクトでは、BacklogにPDF化した議事録をアップして連絡していたが、受け手の体験を考えるとこれは適切なやり方だろうか。 BacklogにPDF化した議事録をアップすると、 Backlogからメールが来る Backlogにアクセスする PDFをダウンロードする Adobe Readerを立ち上げる 議事録の内容が見れる という5つのプロセスが発生する。しかし、PDF化せずにテキストでそのままアップすればどうだろうか。 Backlogからのメールが来る 議事録の内容が見れる（メールに全文転載されるので） とプロセスが大幅に短縮される。見る側の手間が削減されるわけである。さらにBacklogで議事録を見る人の状況を具体的に想像してみよう。 仕事の中では対面、電話、メール、ツールと様々なチャネルが乱立している。これらに掲載された多種多様な情報にさらされ、上司、部下、同僚、顧客から常になんらかの判断を要求されている。行動を起こす必要がある場合、適切なタイミングでの実行が求められている。時間がかかる仕事は、集中する時間を確保しなければならない。そんな彼らのデスクトップ上には、ファイルやフォルダが多数散乱し、複数のアプリケーションが立ち上がっており、ブラウザには常時5つくらいのタブが開いている。そんな中で、何かに追われて忙しく仕事をしている。これが議事録を見る人たちの情景である。 一緒に仕事してるメンバーには伝わってはいないのかもしれないけど、個人的には意識しているところだったりして。 チームで仕事をする以上、コミュニケーションが負担になるとか、検索できないとかをいかに減らせるかは重要課題かな、、、と。場所と形式は重要なんだろうなぁ、、、と。そう言いつつ、いつも情報をありかを教えたりしてるのでまだまだ全然ですが。。。。 全員がリモートだからこそ、自発的な共有は重要になるはずなんだけど、それの前段階として、探しやすいとか、そういった場づくりをするのはすごく必要なんじゃないのかなぁと思っているところ。 Backlog の wiki が満点ではないけど、形式に問題がないなら今の所はそこに寄せておくのがいいのかなぁと思っているところではある。とりあえず Markdown を使えるところに寄せておくのが正解なんだろうな、と。あとは検索ですね。","date":"2018-02-24T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-ux-for-member.html","category":"Blog"},{"title":"ライブ変換に変えてみてから一ヶ月たった","permalink":"https://note.mersy418.com/article/blog-live-input-1month.html","text":"なんか気づいたら今週が終わっていて一週間があっという間に終わってしまった感。今日は今日で帳簿処理して半日終了。計画的に過ごさないとですねー。 ライブ変換を試してみて一ヶ月がたった。 今更だけどMacのライブ変換に戻してみる | mersy notehttps://note.mersy418.com/article/mac-live-input.html とりあえず使ってみてはいるが、確かに変換というか、スペースを押す数は減った気はする。便利なような気はするけども、時々バグったりするからその辺は気になるといえば気になる。まだ、そこまでクリティカルではないけど。 PCだといいのだけど、iPad でも同じようにできるといいなぁという感じで思うことが多い気がする。 あとは、ATOKだといい感じに変換してくれるのがなくなるだけに、その辺はどうするかなぁ、、と。typoを減らせばいいんだけどね、、、","date":"2018-02-24T12:00:00.000Z","guid":"https://note.mersy418.com/article/blog-live-input-1month.html","category":"Blog"},{"title":"セミナーとかでiPadを使っていこう思った","permalink":"https://note.mersy418.com/article/blog-use-ipad.html","text":"日曜日、 BacklogWorld に参加してきた。Sim Free の iPad Pro でメモをとったりしてたけど意外と便利だった。1日中のセミナーでも電源が持つのでありがたい。Macbook は3時間ちょっとしか持たないし。そもそも充電しないと iPhone のバッテリも怪しいし。テキストのメモだけであれば PC 使うよりもいいのかもしれない。テザリングもできるし、手書きもできるな。 先日、電車移動中に音声会議する時に画面共有しながら話すと画面が大きいのでそのまま話せて便利。トンネルだったり、回線が4Gから3Gになってしまうのはちょっと辛かったけど、、、、新幹線でやった時はPCにテザリングでやったけど、 iPad でやってみてもいいのかも？？まぁ、オンライン会議はできるだけ家にいる時がいいけど。 iPad は Kindle 専用くらいで考えていたから小さい方にしたけど大きい方でもよかったかもなー","date":"2018-02-19T11:00:00.000Z","guid":"https://note.mersy418.com/article/blog-use-ipad.html","category":"Blog"},{"title":"【読了】明日に疲れを持ち越さない プロフェッショナルの仕事術 ビジネスライフ","permalink":"https://note.mersy418.com/article/book-healthybody.html","text":"明日に疲れを持ち越さない プロフェッショナルの仕事術 ビジネスライフhttps://www.amazon.co.jp/gp/product/B01JRCY188/ref=kinw_myk_ro_title を読んだ 明日に疲れを持ち越さない プロフェッショナルの仕事術 ビジネスライフ渡部卓クロスメディア・パブリッシング（インプレス） ( 2016-06-20 )mersy’s bookshelfで詳細を見る 仮眠できるときは仮眠しよう。 んで僕の場合は酒が問題だな。それがパフォーマンスを落とす原因であることも明らかであるはずなので、いい感じにバランスを取らないとだなぁ。。。 普段からそこまでストレスは感じない性格だけど。匂いってのは考えてみていいのかもなー。 ストレスを感じないためにできることはあるはずなので、その辺は参考にしておきたい。","date":"2018-02-17T11:12:08.000Z","guid":"https://note.mersy418.com/article/book-healthybody.html","category":"Book"},{"title":"AlfredのWorkflowでコピペ時に引用形式に置換して貼り付け","permalink":"https://note.mersy418.com/article/alfred-workflow-regex.html","text":"メールとかチャットとかでテキストをコピペして引用する時に行頭に &gt; とかつけて貼り付けたりすることがあるんですが。 これまではテキストコピーしたら CotEditor 開いて貼り付けて置換して、コピペという流れでやっていたのだけれど。。。 ちょっと面倒だし、貼り付けるときにそういう形式にできないかなぁ、、、 Alfred あたりでできそうな気もしそうだけど、どうかなぁ、、と Slack に書いてたら早速 BUN さんが作ってくれた。 $query = &quot;{query}&quot;; echo preg_replace(&#39;/^/m&#39;, &#39;&gt; &#39;, $query); とりあえずこれにHotkeyわりあてたら希望通りになって最高！！ もっと早く呟けばよかったと思いました（笑","date":"2018-02-16T22:00:00.000Z","guid":"https://note.mersy418.com/article/alfred-workflow-regex.html","category":"Blog"},{"title":"近所のスーパーで EcoBuy の実証実験が行われていた","permalink":"https://note.mersy418.com/article/blog-ecobuy.html","text":"たまたま八丁堀最寄りのピアゴに行ったら EcoBuy の実証実験やってた、というかその店舗でやってるわけか。 EcoBuyとは｜EcoBuyhttps://www.ecobuy.jp/ “食品ロス”を減らせ 期限が近い商品を買うと「dポイント」 NTTドコモが実験 - ITmedia NEWShttp://www.itmedia.co.jp/news/articles/1801/15/news094.html スーパーの食品廃棄を半減できるか、東京都×ドコモの実験開始 - ケータイ Watchhttps://k-tai.watch.impress.co.jp/docs/news/1102029.html 買ったレシートから登録とか手間が若干めんどくさいなー、という気がするが、これは慣れれば問題ないものなのかなぁ。 取り組み自体の方向性は賛同できるから、このサービスじゃなくても、なんかいい感じで広まっていってほしいなぁ。","date":"2018-02-15T15:00:00.000Z","guid":"https://note.mersy418.com/article/blog-ecobuy.html","category":"Blog"},{"title":"1Password Families を使ってみる","permalink":"https://note.mersy418.com/article/blog-1password-family.html","text":"1Password Families を使ってみる Families - 1Passwordhttps://1password.com/families/ すでに 1Password では複数の vault を使っていて、共有したりしていて、その辺の扱いがどうなるのかなー、とよくわからないところもあったのだけど、 BUN さんに聞いて大体の不明点は解決。 1Password は重要なアプリだけに色々慎重になってしまうな。 なんか、移行があるみたいな記述も見たのだけど、特にそういうのは出てこなかったな、、ということで普通にアイテムをcopyしておいた。 妻と共有してみた。 普段、メインが Mac なのであまり気にしてなかったのだけど、 iPhone しかないような状況だと、1pass の手順が若干変わると言うか、意外と面倒そうだなぁ、、、とレクチャーしながら思った。 これだったら、 iCloud か Chrome に預けてしまうかもしれないよなぁ、、、と。あくまで、複数環境あって、 iPhone に限定されてないからこそ、 1Password が便利ではあるんだろうけど。 iPhone しか使わないのであれば、 iCloud にロックオンされてもいいだろうけど、 Chrome（Google）に依存するとかその辺はまだあるんだろうなぁ、、と思った。と言うか、PCとSPを使うのが当たり前だと気づかなかったのだけど、SPだけだと色々不便なところもあるのねぇ、、、と今更ながらに。 参考リンク 1Passwordアカウントのつくりかた （個人および家族アカウント） – Lifehacking.jphttp://lifehacking.jp/2017/03/creating-a-1password-account/ 1Password Families契約してみた - Qiitahttps://qiita.com/pechefamille/items/45179098bb3c4b8e6a09 1Password サブスクリプション版でおしゃれに家族を守る - おしゃれな気分でプログラミングhttp://neko-mac.blogspot.com/2017/05/1password.html 1Passwordを買い切り版からライセンス版に移行しましたhttps://blog.lorentzca.me/move-existing-1password-to-license-version/","date":"2018-02-12T20:00:00.000Z","guid":"https://note.mersy418.com/article/blog-1password-family.html","category":"Blog"},{"title":"タスクの確認をメール通知からAsanaに変更してみた","permalink":"https://note.mersy418.com/article/blog-todo-asana.html","text":"今まで、意外とメーラー（Gmail）がTodoの肝になってたところがある。 Backlogでタスクの確認もしてはいたけど。 いろんな案件のやりとりが集中してくるのは、あくまでメール通知なので、 backlog とかの通知含めて、未回答なものが全てmailに残る感じにしていた。 ただ、それはそれでいいのだけど、来た日はまだしも、来てから日付が経ってしまうと見落としがちだし、対応の優先度が下がってしまうな、、と。 メールへの返事がすぐできるなら、チケットを別の担当にアサインするなり、コメント返すなり、それをしてしまう。それが2分とかすぐ終わらないなら、とりあえず Asana のタスクに登録しておく、と言うことをはじめてみた。 Asana じゃなくて、 bit part の backlogでもいいのだけど、その辺は検証も兼ねて、ひとまず Asana にしてみた。 backlog １つで完了できればいいのだけど、 space をまたいだ時点でその方法が使えないので、とりあえず別ツールの Asana を母艦にすることにした。アプリを切り替えることでやることを切り替える、ということもできるかなと。。。。 個人的にそこを確認すればいいようにしておくようにしつつ、各担当もそこを見れば、他の案件なりプロジェクトも串刺しで読めると便利なのかなぁ、、と。。。全員のタスクを集約するのはちょっと大変なんだろうけどな。。。 あとは、 Asana に集約できれば、他の人にもメリットがあるのかなぁ、、、と言う期待がある。 Asana へはページ開いて、タスク登録してるけど、この辺はメール登録の方が早いのかなぁ。。。試してみよう。","date":"2018-02-11T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-todo-asana.html","category":"Blog"},{"title":"写真をどうやって保存しておくか","permalink":"https://note.mersy418.com/article/blog-keep-photos.html","text":"橋本さんのブログを読みつつ、、、 PowerPhotosを使ってMacの写真アプリのライブラリを分割バックアップする | BridgeBook.JPhttps://bridgebook.jp/powerphotos-mac 橋本さんはデジイチとかでとったりされてるからこういう管理方法をされてるんだと思うのだけど。 コンデジすら使わなくなってしまったこの頃。ほんと、スマホでしか写真も撮らないのが僕も妻もそんな感じで。 その写真をどこへ保存するか、と言うところで。妻は、iPhoneを買い換える時もデータ引き継いでるらしく、いまの iPhone にそこそこ残ってるらしい。その先として Amazon Prime には保存してるけど。 僕は、そもそも買い換えるタイミングでまっさらなところからスタートなので、どこかにあげてないとなかったことになってるなぁ。。。と言うか、 マシン自体を短周期で変えてしまうコスパの悪さなので、マシンに保存しておくと言う発想がなかった。とりあえず、 flickr にはあげてあるはずで、 S3あたりにも保存したよなー、、、と言う気がしつつつ。S3落ち着いたら見直してみよ。。。 あとは、 Amazon Prime を始めてから Amazon Prime Photos にもバックアップとしておいてあるんだけど、昨日本を読んで、 Google Photos にもおくようにした。 この写真たちを見返すのか？？と言うと、甚だ疑問ではあるのだけど、見返す可能性もあると思って、とりあえず複数環境においておくのがいいんだろうな、、、と。。。 この写真たちはいつ捨てられることになるんだろうな。。。。 妻の手元には、出力した写真も大量にあって。これらをデジタルデータにして、ポンと Amazon Prime なり Google Photos においてくれれば楽だろうな、、、と。サービス自体ありそうだけど。。。本を自炊するサービスみたいなもんだろうしねぇ。。。 この辺って、まだとった写真を次どう使うか？？と言う局面に出会ってないからあまり問題が顕在化してないんだけど、そう言う場面になった時にどうするのがいいんだろうな。探せるか？と言うと、探せる自信はないかもな。写真を日常的に撮っていて仕事にしてる人からしたら既に当たり前の話なのかもしれないけど。","date":"2018-02-11T12:40:00.000Z","guid":"https://note.mersy418.com/article/blog-keep-photos.html","category":"Blog"},{"title":"【読了】 半年だけ働く。","permalink":"https://note.mersy418.com/article/book-work-halfyear.html","text":"Amazon.co.jp： 半年だけ働く。 eBook: 村上 アシシ: Kindleストアhttps://www.amazon.co.jp/exec/obidos/ASIN/B078GP6MP9/mersys-22/ref=nosim を読んだ。 半年だけ働く。村上 アシシ朝日新聞出版 ( 2017-12-20 )mersy’s bookshelfで詳細を見る 厳密にはフリーランスではないけど、多分、端から見たらそんな風に見えてるような気もするが。。。 とりあえず、一緒に仕事させてもらってる方々に恵まれてるので、その人たちといい感じに仕事しつつ、普段からスキルアップなりアウトプットなりしている姿を目にしているので、それに少しでもついて行くようにすることが必要なんだろうな、と。 言問の仕事をするようになって変わる部分もあったけれども、色々といい方向には動いているのかなぁと思ってはいる。忙しいけど。この本の半年働いて、半年休むではないけど、今はがむしゃらにやるタイミングかな、とは思っているのでそれをやりつつ、将来に向けての足場作りかな、とは思っているところ。 企画業務に特化したスペシャリストであれば、新事業の企画策定の支援メンバーとして、単価の高い案件が多くあります。 ちなみに私の場合は、コンサルティング業務におけるＰＭＯのプロフェッショナルです。ＰＭＯとはプロジェクト・マネジメント・オフィスの略で、プロジェクトマネージャーの意思決定や業務を支援し、プロジェクトを円滑に進行させるための、専門のサポート部隊のことです これらの職種に共通するのは、「問題解決のプロフェッショナル」として対価が支払われる点です。どんな企業でも自社内で問題を解決できればそれに越したことはありませんが、プロジェクトを組成する際に適した人材が社内に存在しないケースが多々あります。 プロジェクトを進めるっていう仕事が多いので、その辺のスキルというかできることを伸ばしつつ、ここのところの反省として最低限やっておかないと色々と面倒になることも見えてきたので、単価というラインではないけれども、そこは線引きとしてキープしておかないと、個人としてもチームとしてもいい結果、いい仕事には繋がらないな、ということが見えてきた気がする。 実戦で解決できることもあるので、その辺ちゃんとやらないとだなぁ。あとは学びなんだろうな。 ちょうど今日、短歌の話は少しだけチームで話題になったりしたのがなかなか熱い（笑繁忙期とかもあるしなー。 とりあえず、写真のバックアップ先に Google Photos も追加した。 半年だけ働く。村上 アシシ朝日新聞出版 ( 2017-12-20 )mersy’s bookshelfで詳細を見る","date":"2018-02-10T12:00:00.000Z","guid":"https://note.mersy418.com/article/book-work-halfyear.html","category":"Book"},{"title":"結局RSSリーダーはReadKitにしました","permalink":"https://note.mersy418.com/article/blog-readkit.html","text":"結局、RSSリーダーは ReadKit に戻ってきた。 Inoreader（ https://www.inoreader.com/?lang=ja_JP ） は良いんだけどちょっと待つのが何となくつっかかる感じで馴染めず。。。 もう少し待てば問題ないのかもしれないけどなー。。。","date":"2018-02-08T20:00:00.000Z","guid":"https://note.mersy418.com/article/blog-readkit.html","category":"Blog"},{"title":"日英の切り替えをKarabinerに戻してみた","permalink":"https://note.mersy418.com/article/blog-karabiner.html","text":"昔は Karabiner 使ってて、どっかから「⌘英かな」を使ってきてたのだけど、なんか調子悪いなー、って書いたら BUN さんに最近の Karabiner で問題ないと教えてもらったので再度インストールしてみた。 Karabiner - Software for macOShttps://pqrs.org/osx/karabiner/本家 Karabiner-Elements が USキーボードの左右 Commandキーによる「英数 / かな」の切り替えに対応！ | Rhttps://beadored.com/the-original-karabiner-elements-command-switching-eisuu-kana/ 問題なく使えている様子。 ただ、Mac の設定で caps lock を control に変更してるのを上書きして無効にする？みたいなので simple modications で caps_lock を left_control に設定した。","date":"2018-02-07T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-karabiner.html","category":"Blog"},{"title":"Bearのタグリストにカスタムアイコンがついていた","permalink":"https://note.mersy418.com/article/blog-bear-custom-icons.html","text":"メモ系は Bear を使ってるんですが最近なんか一つのタグだけ表示が違うなー、、、と。 気になるから色々調べたりしてたのですが、よくわからず、何だろうなー状態。ファイルが壊れてたりしたら嫌だな、と。 そんなことを slack に書いてたら BUN さんが教えてくれたんですが、 1.4 からタグにカスタムアイコンが出てたらしい。 List of Custom Icons for Tags in Bear app – DJ Chuang – Mediumhttps://medium.com/@djchuang/i-would-love-to-see-a-list-of-the-100-tagcons-in-the-bear-app-so-far-ive-only-discovered-these-b45a5980e979 んで、これは #beauty のタグに着くアイコンなんだそうな。。。 確かに他もでた。 ということで、この設定はOFF!!! BUNさんの検索力素晴らしい。。。自分の検索力の無さよ。。。","date":"2018-02-06T20:00:00.000Z","guid":"https://note.mersy418.com/article/blog-bear-custom-icons.html","category":"Blog"},{"title":"Sketch を使ってみる","permalink":"https://note.mersy418.com/article/use-sketch.html","text":"Sketchhttps://www.sketchapp.com/ 持ってはいたけど、今まで特に使うことがなかった。。。 ひとまず、このプラグインを使ってみたかったというところが大きいので触ってみている。 Sketch Notebook Plugin: document designs and wireframes easier. By Marcos Vidalhttps://marcosvid.al/sketch-notebook/ ワイヤー、デザイン、仕様書はできるだけ1つにまとめたほうがいいと思ってるので。。。自分のためというより、チームで仕事してくならマストかなぁと。デザインはデザイナさん次第ではあるから、場合にもよるか、、ワイヤーと仕様書くらいであれば、パワポでも他のツールでもいいんだけど。。。 別途 md ファイルにしておくことは可能だけれどもできる限りその辺は一箇所にしておいた方が、CMSの実装までがやりやすくなる気がする。 もちろん、ファイルリスト（URL一覧）、コンテンツタイプ設計書、フィールド設計書、などは必要だし、それらは SpreadSheet の方がいいんだろうな、という気はする。 Sketch Cloud が使えない。。Notebook プラグインだけで Sketch を使うのでいい気がするのだけれども、 Sketch Cloud のサインインして戻ってくると認証されてるはずなのにuploadにいけなくてなんだろうな。。。 ライセンス買って登録して見たけどダメだった。マシンの問題かなぁ。 Invision で連携連携してコメントはできる。テキストの編集とかはできないけど。 これから試して見ること バージョン管理 Zeplinとの連携 ワイヤーの作成 Sketch Cloud","date":"2018-02-05T22:00:00.000Z","guid":"https://note.mersy418.com/article/use-sketch.html","category":"Blog"},{"title":"ツールを使ったから進捗が滞りなく進む訳ではないという話","permalink":"https://note.mersy418.com/article/blog-task-management-tool.html","text":"以前、妻とタスクの消化、締切の話をしたことがあって、妻のところではExcelで管理してるという話をしていて。そのExcel自体は共有のフォルダっぽいところで管理してるから、そこで進捗がわかるから問題ない、んだけど、終わらないことがあったり漏れてることがある、みたいな話をしていた。（妻はWEB系ではないです） そもそも、一覧系のツールで管理してるのは一覧で見たい管理者のような人向けにはいいだろうけど、実際にやる人たちからしたらやりにくいんじゃない？という思いがあるので、そういう話を聞くと Backlog とか Redmine とかそういったツールでやるのがいいんじゃないの？と思ってしまう自分がいる。 が、んじゃBacklogを入れてるから自分のところが問題ないか？というとそんなことはなくて、オンスケで問題なく動くことの方が稀な気がしている。 期日より前倒しで終わらせてくれることもあるし、時には終わらないこともあるし。その辺は人による場合もあれば外部要因だったりもするだろうし、依頼する側の問題だったりもする訳で。 目安がないといけないので、何かしら日時的な管理をしやすいツールを使うのは必要だと思うのだけど、それを使った上でオンスケで進ませるためには何かまた別なものが必要なんだろうな、と。 Web制作会社の危機感から模索する新しいプロジェクト管理の方法とは〜独自のプロジェクト開発スタイル | TeamHackershttps://teamhackers.io/h2o-space-web で、たにぐちさんが書いてたけど、 Backlogの場合だと、タスクの整理や分類にどうしても使いづらさやわかりにくさが目立つなと感じます。期限を過ぎて、アラートが出ててもそれを無視し続けることになっていく、なんのためかわからないアラートって、Backlogのあるあるじゃないかな。 当社でも、自分を含め２名のディレクターがBacklogの「そうじ」をきめ細かく行なうことでその解決を図るようにしています。ツールによる自動化とはまだまだ距離がある話です。もちろん、タスク登録のルールや管理上の約束事は決めていますし、新規タスク登録もそれぞれの担当者に任せられるようにしていますが、ディレクターが管理してないと、ツールだけではうまく回っていかないことは何度も実証済みですね。うまく回らないということは、そもそもツールを使う意味が無いという逆転現象も発生します。 この辺の話にも繋がってくるんだよなぁ、、、という気がしている。 このあるあるに陥る原因は、チームにより原因もそれぞれだと思うのでその辺は少し立ち止まって考えて見ないといけないんだろうな、と思っているところ。","date":"2018-02-04T22:00:00.000Z","guid":"https://note.mersy418.com/article/blog-task-management-tool.html","category":"Direction"},{"title":"Yummy FTP Pro を FTP ソフトとして使い始めてみた","permalink":"https://note.mersy418.com/article/yummyftppro.html","text":"Keychain がぶっ壊れたのか、繋がらないサイトがあったので、 BUN さんに教えてもらったこちらのFTPソフトを試してみた。 Yummy FTP Pro - Mac FTP + SFTP + WebDAV client software at its besthttps://www.yummysoftware.com/ とりあえず繋がらなかったサイトにもサクッと繋がった。 その上、Backlog の WebDAV も問題なく繋がった。 Transmit だと繋がらなかったのでこの辺ラッキー。使うかどうかは置いといて。。。。 Transmit の最新版を試してみるという手もあったわけだけど。。。S3とか使えるしなー。あれが結構便利なんだよな。","date":"2018-02-03T21:00:00.000Z","guid":"https://note.mersy418.com/article/yummyftppro.html","category":"Blog"},{"title":"iPadでのブログ原稿ツールにBywordを使ってみる","permalink":"https://note.mersy418.com/article/ipad-byword.html","text":"ちょっと延々と電車に乗ってる時にこのブログの原稿を描きたいなぁと思うことがあり色々と調べていた。 とりあえず、iPadで開いたので、Dropbox にある Hexo の原稿の Markdown の原稿データをいじりやすいアプリはないものか？ということを延々と探してた。 iPad\u0010 \u0010でも Dropbox の同期が使えるアプリはあるのだけど、専用のディレクトリを切るとかだったりでそれはすでにあるディレクトリのと対応が良くないので、無しということで。 今は、PC で作業するときは Dropbox のディレクトリ内に hexo 用のディレクトリを切ってそこで作業してるので、そのディレクトリにあるmdファイルを操作しやすい、という前提でアプリを探してみた。 boostnoteとかも良さそうではあったのだけど、専用のディレクトリを切るっぽいので今回はなしってことで、ひとまず Byline に落ち着いた Boostnote | Boost Happiness, Productivity, and Creativity.https://boostnote.io/ iAwriter が良さそうな気がしたのだけど、Dropboxでデータが消える、みたいなレビューをみたのでちょっとそれは地獄なので、、、と。。。 iAhttps://ia.net/writer/ 色々みてたら、 Byword \u0010\u0010に落ち着いた。 Byword - Markdown text editor app for Mac, iPhone and iPad.https://bywordapp.com/ 既存であるものだと formatter が書かれてあるので楽だけど、新規だとそうもいかない気もするな。。。 テンプレート的なものがないかどうか、その辺をみてもいいのかもな。 Hexo を使ってる時点で Publish は PC 前提になるのだけど、そこはまぁいいかなー、という気がする。 iPad でのキーボードも考えた方が良さそうだ。 \u0010ちなみに、markdown でのメモツールとしては Bear を今はメインで使っている。Mac と iPhone で。 Bear - Notes for iPhone, iPad and Machttp://www.bear-writer.com/ これでしばらくはいいかなー、というところ。 ただ、ブログを書く用途とは別なので、そこは混在させたくないな、となんとなく思ったので、アプリレベルで別にしておこうかな、と。できるかどうかわからないけど。。。","date":"2018-02-03T12:33:39.000Z","guid":"https://note.mersy418.com/article/ipad-byword.html","category":"Blog"},{"title":"Github Pages のこのサイトをSSL対応した","permalink":"https://note.mersy418.com/article/blog-githubpage-https.html","text":"今更だけれども。 CloudFrontを利用して独自ドメインのGitHub PagesをHTTPS化する - Qiitahttps://qiita.com/iogi/items/82618c1d56abba6b9337 Github Pagesでホスティングしつつ、CloudFrontを使ってサイトをSSL対応の独自ドメインにする - Qiitahttps://qiita.com/kechol/items/9609e1ab4a673e05b613 この辺の記事を参考にさせてもらってこのサイトをHTTPSにした。","date":"2018-01-28T08:10:16.000Z","guid":"https://note.mersy418.com/article/blog-githubpage-https.html","category":"Blog"},{"title":"CMS実装のための仕様共有方法を考える","permalink":"https://note.mersy418.com/article/communication-cms.html","text":"ワイヤーにコメントをつける感じのくらいが個人的にはベストだと思っているのだけれども。 開発者のやりとりも捗る！プロトタイピングツール「InVision」って何？ - WPJhttps://www.webprofessional.jp/evolution-of-prototyping-tool-invision/ そう考えるとPowerPointが今のところはまともなツールのようなきがしてしまう。 いいと言えばいいのだけど、PowerPointはワイヤーを作る方の機能が若干足りない気がする。 DIST.18 「Sketch時代のWebデザインワークフロー」 - 勉強会メモ - Qiitahttps://qiita.com/ezawa800/items/b465180208419a96662e marcosvidal/Sketch-Notebookhttps://github.com/marcosvidal/Sketch-Notebook この辺を読んでみて、とりあえず Sketch でやって見るのが良さそうな気がしている。他のアプリケーションもいずれは似たような機能ができるようになるとは思うのだけど。 Mac しかないみたいだけど、その辺は Invision あたりを経由させるとかでどうにかしたいところではある。 このへんは案件によっても異なってくるだろうし、どういうデザインデータを共有されるか、とかでも変わるだろうし、どのスコープ、タイミングから入ってくるかも変わるだろうから一概には言えないだけに難しいところだなー。 とりあえず、なんとなくなワイヤーとpsdだけが来てしまって、さて、CMSに組み込む際に仕様をどこかにまとめておかねば、というタイミングで、markdownのテキストにまとめるだけで、実装する側が迷わずにいけるのかどうか？この点を重視しないといけないなぁ、と思っているところである。 とは言え、テキストレベルですら仕様をまとめきれていないこともあり、メンバーに迷惑をかけているのでそれはそれとして個人的な課題であるので改善しないといけないな。。。","date":"2018-01-28T05:58:01.000Z","guid":"https://note.mersy418.com/article/communication-cms.html","category":"Direction"},{"title":"Ramboxを使い始めてみた","permalink":"https://note.mersy418.com/article/use-rambox.html","text":"ちょっと必要があってRamboxを使い始めてみた。 Ramboxhttp://rambox.pro/ 似たようなツールはいくつかあって知ってはいたけど、使ったことはなかった。 これまでメールとカレンダーはGoogle関係のみだったので、MailPlane をずっと使い続けていた。単にこれはなれでしかなくて、他のツールでもいいんだけど。 今回Googleではなく、Office 365 のアカウント？アウトルックのアカウントのメールを受け取る必要があり、Webメールを常に見るのはちょっと面倒だな、と思ったので常時開いているメール関係のアプリに集約したかったというのがあり。 \u0010常時開いているアプリなので見落としも減るだろうな、と。Rambox に Slack も入れてみたけど、Cmd + F で検索が動かないとか基本的なところがきになるので、 Slack はこれまで通り標準のアプリで動かしておくことにする。 Rambox \u0010\u0010\u0010\u0010\u0010\u0010\u0010\u0010\u0010\u0010メールアプリだとリンクのコピーができないのがちょっと使いづらい。フォント周りはなんか太いのか少しきになるけどそのへんはいずれ慣れるかもしれないからとりあえずスルー。 探してみたら Shift も対応してそうなので次はそれを試してみてもいいのかもしれないな。 Shift - The Best Desktop Email Client for Gmail and Outlook.comhttps://tryshift.com/ 軽いといいんだけどなー。 【追記20180127-1650】Shift を試して見た。今回発行されている Outlook アカウントだとアクセスできる権限が付与されていないようで使えなかった。残念。","date":"2018-01-27T05:32:47.000Z","guid":"https://note.mersy418.com/article/use-rambox.html","category":"Blog"},{"title":"今更だけどMacのライブ変換に戻してみる","permalink":"https://note.mersy418.com/article/mac-live-input.html","text":"なんとなく最近日本語入力が意図した感じになっていない気がしていて、ATOKのせいというよりは自分の入力ミスが原因なんだろうなぁとは思うのだけれども。。 ATOKの設定を少し変えてみたりしたけど、特に変わらず。というか、ATOKの設定が多くて他にあるんだろうなぁ。。。 変換の区切りが良くないのか、なんなのか。 とりあえずは入力をミスらないようにタイピングの練習をし直した方がいいような気もするが、今更だけどATOKを止めてみて、macのライブ変換を使ってみることにする。 どうなることやら。 音声入力の方が早い場合もあるわけで、そういうのもそろそろ考えてみてもいいんだろうなー。 参考リンク 新Mac OSの日本語入力が「驚くほど使える」のを知っていますか？ - 日経トレンディネットhttp://trendy.nikkeibp.co.jp/article/pickup/20151014/1066979/?rt=nocnt 【mac OS】日本語入力時に入力ミスを自動修正してくれる『タイプミスを修正』をオン/オフする方法 ≫ 使い方・方法まとめサイト - usedoorhttp://usedoor.jp/howto/digital/mac-os/os-nihongo-nyuuryoku-typing-miss-jidou-shuusei/ Macintoshの文字入力「ライブ変換」機能が快適すぎる理由 ｜IT小ネタ帳http://setsuzoku.nifty.com/koneta_detail/170306000237_1.htm","date":"2018-01-27T05:23:55.000Z","guid":"https://note.mersy418.com/article/mac-live-input.html","category":"Blog"},{"title":"どのプロジェクト（タスク）管理ツールを使うか問題2017","permalink":"https://note.mersy418.com/article/blog-20180120project.html","text":"ちょうど昨年後半 bit part でもredmineからの乗り換えを考えてた。 FablicにJIRAを導入をしようとしたけど諦めた話 - inFablic | Fablic, inc. Developer’s Blog.http://in.fablic.co.jp/entry/jira-not-adopted gitlab wrike taskworld backlog あたりをベースに検討して、費用ともろもろ考えて結局backlogにおちついた。 taskworldがリポジトリ周りのサービスとしっかり連携できればもしかしたらtaskworldになったかもしれない。 んで、最近、複数のspaceのbacklogにいて、それらを串刺ししてみれないか、というのがあったりもする。結局それぞれを見に行かないといけなくなるし。 この辺サービスとしてつくってみてもいいのかなぁ。 Backlog ショーケース｜開発者向け｜Backlog [バックログ]https://www.backlog.jp/developer/showcase/ で紹介されてる Backlog Milestones が近いのかな。ちょっと試してみよう。 追記20180120-1150 Githubを対象にした ZenHub や Waffle.io みたいなもんとかんがえるといいのかなー。 ZenHubhttps://www.zenhub.com/Waffle.iohttps://waffle.io/","date":"2018-01-20T02:16:24.000Z","guid":"https://note.mersy418.com/article/blog-20180120project.html","category":"blog"},{"title":"memo blogsync","permalink":"https://note.mersy418.com/article/blogsync-hatena.html","text":"ブログ書くツールを探してるというか考えているのだけど。MTでもWPでもFlat File系でもいいといえばよい。 なんとなく、Githubとかにmdファイルと画像とかをcommitしたら反映されるようになってほしいな、というのがありつつ。そのうえで管理画面的なのもあって、そこから更新すると同じようにGitに反映されるのがいいなぁ、と。 前者はPCとかで作業してるときはその方が楽そうだし、後者はブラウザからやるときは楽そうだな、と。netlify cms は iPad で日本語入力が出来なかった。。。それだけが残念すぎる。 mdファイルで考えてるのはデータの持ち運びやすさが大きいかな、と。 サーバに静的ジェネレータおいといてそこで生成させるとかでも出来そうな気がするけど。MTとDataAPIでもいいわけだし。 contentfulとかnetlify cmsとかみてて大体よさそうなのだけど最後なんかちょっとたりないな、、と。ないなら作ればいいのかもしれないけど。 はてなブログと同期するツールがあったのだけどこれがなかなかよさそうなかんじではあるけど、鬼門はやはり画像か。 motemen/blogsync: Push and pull blog entries from/to local filesystemhttps://github.com/motemen/blogsync Markdownドキュメントをgithubで管理して、はてなブログでホストする ~ Mackerelの場合 - Hatena Developer Bloghttp://developer.hatenastaff.com/entry/developers-advent-calendar-2015/day7 この辺なんかいいツールがないかなー、といってブログを書こうとおもって、ツールを探すという本末転倒なことは変わらない。 API提供してるものを間にかませつつ、SPA的なフレームワークみたいなのがあれば良さそうな気がする。","date":"2018-01-20T00:41:18.000Z","guid":"https://note.mersy418.com/article/blogsync-hatena.html","category":"Blog"},{"title":"memo netlify cms","permalink":"https://note.mersy418.com/article/netlify.html","text":"Netlify CMS | Open-Source Content Management Systemhttps://www.netlifycms.org/docs/start-with-a-template/ CMSっぽいものがあるみたいなので試してみた。 githubのリポジトリと連携。 Static Site Generator については GatsbyJS を選択してみた。Hugoも選択可能。 GatsbyJShttps://www.gatsbyjs.org/ ボタンをポチるだけで問題なくdeployまでできてすげー、と。 /admin/ で管理画面ぽいのもあるのでコレは便利そう。 最初、管理画面から記事を投稿した際にpathの指定を / からはじめなかったからコンパイルエラーになっていた。 原稿のmdファイルもmasterにコミットすれば反映された。これは結構理想に近いかもしれない。 アイテム周りの置き場所がいまいちわかっていないのでその辺は整理してみる。 Home | Gatsby + Netlify CMShttps://mersy.netlify.com/ できれば見た目の選択が簡単にできて、あとは原稿とアイテムを管理画面、ローカルからのコミットの両方が出来れば結構いい感じかも。 下書きっていう概念がないのかな。その辺はもう少しドキュメントを読んでみようと思う。 もし問題なく使えるようであれば、サブドメインを設定しつつ、githubpagesにおいてるものを持って行ってもいいのかもしれない。pathの追加が必要ってことだろうなー。","date":"2018-01-14T11:41:44.000Z","guid":"https://note.mersy418.com/article/netlify.html","category":"CMS"},{"title":"memo Contentful","permalink":"https://note.mersy418.com/article/contentful.html","text":"Contentful: Content Infrastructure for Digital Teamshttps://www.contentful.com/ コンテンツタイプの管理ができるCMSみたいなもの。 ブログのベースに使えるか試してみる。 contentful/discovery-app-react: A React.js based version of the Contentful Discovery apphttps://github.com/contentful/discovery-app-react 用意されてるサンプルアプリはこんなかんじでコンテンツタイプの中身を見ることが出来るアプリだった。 kristofferdarj/contentful-vue: A small blog with a vue.js frontend and contentful as backend. Used for my personal blog.https://github.com/kristofferdarj/contentful-vue これを一応触ってみたけどエラー表示。多分設定とか少し必要そうなので後回し。 cloneして書いてるとおりにコマンドたたいて、store.jsの設定をいじればいいんだとは思うが。 とおもって見てたら単にコンパイルがこけてた。 ERROR Failed to compile with 1 errors 9:33:24 AM error in ./src/components/v-hero.vue Module build failed: @include mdc-theme-prop(background-color, $color, $edgeOptOut: true); ^ Mixin mdc-theme-prop has no parameter named $edgeOptOut in /Users/mersy/Dropbox/works/sample-contentful_vue/contentful-vue/node_modules/@material/button/_mixins.scss (line 42, column 55) /contentful-vue/node_modules/@material/theme/_mixins.scss の22行目にある @mixin mdc-theme-prop($property, $style, $important: false) { を @mixin mdc-theme-prop($property, $style, $important: false, $edgeOptOut: true) { にしてコンパイルは一応通った。 表示とか直すの大変なので一旦終了。 次はこれを試してみる。 Nuxt.jsとContentfulでブログ作ってみた - Qiitahttps://qiita.com/hisako135/items/082115b50df92ef3e941 うまく動いていないので後で調べる。","date":"2018-01-14T00:27:05.000Z","guid":"https://note.mersy418.com/article/contentful.html","category":"CMS"},{"title":"【読了】初めての自動テスト","permalink":"https://note.mersy418.com/article/book-the-way-of-the-web-tester.html","text":"初めての自動テスト ―Webシステムのための自動テスト基礎https://www.amazon.co.jp/exec/obidos/ASIN/4873118166/mersys-22/ref=nosim を読んだ。 テストは自動テストというよりはシナリオテストを行うことが多い。パフォーマンステスト、負荷テスト的なのは別だけど。 テスト関係自体まだまだよくわかっていないところがあるなぁとは思うが、こういう自動テストも出来るようにしておく必要があるんだろうな。安部さんに相談だ。 んで、こういうテストするにあたってはテストエンジニアだけじゃなくて、プログラムを書くエンジニアもフロントエンドを担当するエンジニアも考えることがあるんだな、と。 チームで開発していくのだからそういった所を意識していかないとなんだろうな。","date":"2018-01-08T08:22:01.000Z","guid":"https://note.mersy418.com/article/book-the-way-of-the-web-tester.html","category":"Book"},{"title":"立ち戻るメモツール","permalink":"https://note.mersy418.com/article/dailymemo.html","text":"使い捨てのアウトラインというので、そこに一纏めにするというのがあったのだけど。とりあえず、似たようなことを、mac, iOS 標準のmemoアプリで試してみたりしてる。確認しようと思ってることや、今日やらないといけないことを忘れないようにするメモ、とか。 Milanote なんかも良さそうな気はしている。 The notes app for creative work - Milanotehttps://www.milanote.com/ ただ、結構リッチなかんじだから、スマホだとどうなんだろうな、とかが気になる。テキストメモ中心なら scrapbox とかもいいんだろうか。。 Scrapbox - A workspace that organizes for youhttps://scrapbox.io/ どちらかというとたくさん書いて整理する、という感じなんだろうな。 昔は紙のノートというページ数も幅も制限があるなかで整理してまとめるとかしていた気がする。書くのもタイピングよりは手書きの方が遅い訳だし。（なんか、最近変換がばかになったのか、自分の日本語がおかしいのかtypoなり誤変換が多い気もするのだけど・・・） デジタルなメモとしてのノートを手に入れて、コレまでの制限が取っ払われてハッピーになった気もする。が、その制限のないなかで逆にとっちらかったり、よくわからなくなってしまったりしてる気もする。 ツールを使う側が追いつけていない、成長できていないんだろうな。 とりあえずその母艦というか、スタート的なメモとして、Workflowy をまた試してみるかな。 WorkFlowy - Organize your brain.https://workflowy.com/","date":"2018-01-04T13:06:58.000Z","guid":"https://note.mersy418.com/article/dailymemo.html","category":"blog"},{"title":"【読了】アウトライン・プロセッシング入門","permalink":"https://note.mersy418.com/article/book-outliner.html","text":"アウトライン・プロセッシング入門https://www.amazon.co.jp/exec/obidos/ASIN/B00XCIETIG/mersys-22/ref=nosim を読んだ。 アウトラインで書くというのは悪くないし、WorkFlowyとかはいいかもなー、と思ったりもしている。が乗り換えられてない。 データ自体のポータビリティが若干気になるところではあったりもする。 アウトライン的な使い方は難しいかもだけど、markdownでlistでいいかな、とか思ったりもしてしまう。 アウトライナーの使い方と昨日読んだカンバンは使い方の自由度が高いというところは似てるんだろうな。 文章を書くということが増えるのであればありなのかもなー。書類系とかはありなのかもしれないな。 あとは、何だろうな、パーツ的につかうとなると、Scrivenerとかも文章かくにはいいのかもしれないけど。 Scrivener | Literature &amp; Lattehttps://www.literatureandlatte.com/scrivener/overview あとは、 Ulyssesとか。この辺は好みの問題か。 共有を優先するなら paper（ http://paper.dropbox.com/ ） とか Google Docs （http://drive.google.com/） で十分な気がしないでもない。","date":"2018-01-04T12:47:55.000Z","guid":"https://note.mersy418.com/article/book-outliner.html","category":"Book"},{"title":"カンバン仕事術","permalink":"https://note.mersy418.com/article/book-kanban-in-action.html","text":"「カンバン仕事術」を読んだ。https://www.amazon.co.jp/exec/obidos/ASIN/487311764X/mersys-22/ref=nosim WIPとリードタイムの話はなるほど、とは思った。継続的なプロダクト開発とかだとフィットしやすいんだろうなぁと言う気がしつつ。複数の受託案件のようなプロジェクトが並行して動いていて、メンバーアサインも複数プロジェクトにまたがる場合どうするのがいいのか悩ましいところだなぁ、と。 プロジェクト単位のボードがありつつ？ユーザー単位のボードがあり、全社ボードがある感じになるのがいいのか？プロジェクトによっては分類の方法もかわるだろうから、そういうわけにもいかないだろうしなぁ。 いろんな案件に携わっていて、日々Backlogのチケットをあちこち返しているのは、コインを次の人に1つずつまわすような作業になっているんだろうか？？ サービスクラス＝プロジェクト？、という風に考えられなくもないけど、クラス＝優先度的な発想、というかんじで、緊急とかがあるんだろうな。緊急、確定納期、欠陥、無形、通常項目、が例としては出ていたけど。backlogでいうところだとタスクの種別みたいなものか？ リモートでコアタイム的なものがない場合、振り返りをどのように行うか？スタンドアップをどのように行うか？振り返りの準備を継続して用意しておきつつ、適当なタイミングで行えるか？ 予定通りにすすめられない・進まない、のは計画の立て方含めて開発着手前の前提とかスケジュール立てる時点で間違ってるところが大いにありそうな気がしている。根本的に考え直さないといけないんだろうな。ツールの使い方どうこうでは解決しなささそうな気がするし、まずは自身の行動を見直さないといけない気がする。 現状はBacklogを使っているがこれにカンバンの見える化的なわかりやすさをどうにか出来ないかは考えてみても良さそう。あとは、例としてあげられていたようなステップをへるものの場合であれば使い方を工夫すれば調整が出来そうな気もするから何かしら考えてみたい。 リモートだとリアルホワイトボードは難しいからホワイトボードっぽいことが出来るWebサービスを使うか、Trelloみたいなカンバン系のサービスを使うか、とかでも良いのかもしれない。 アサインされてるものを、未着手なのか、着手したのか、一旦ペンディングにしているのかを見えるようにするだけでも少しはかわるだろうし、複数あるチケットについて、担当ごとに優先順位を付けられるだけでも変わるのかもしれない。各工程におかれるWIPにアサインされた人をアバターでわかるようにする話はあるけど、その人はそれ以外のプロジェクトもあるからどのようにして串刺ししてみれるかが肝になりそうな気もする。 そもそも、複数プロジェクトにまたがらないようにする、というのも手ではあるのかもしれないが。ツールに使われないようにしつつ、ツールの見直しも含めて、ツールの制約の中で出来ることを模索していきたいところ。 WIPの制限によるリードタイム短縮の話は、成果としては大きいものかと思うので、それに当たるような改善はしていかないとだ。","date":"2018-01-03T07:17:13.000Z","guid":"https://note.mersy418.com/article/book-kanban-in-action.html","category":"Book"},{"title":"【読了】「あるある」で学ぶ 右肩上がりのWebマーケティング","permalink":"https://note.mersy418.com/article/book-aruaruwebmarketing.html","text":"「あるある」で学ぶ 右肩上がりのWebマーケティングhttps://www.amazon.co.jp/exec/obidos/ASIN/B072X7ZHW6/mersys-22/ref=nosim 普段の制作の進め方など自分が制作側として出来ているかどうか？の振り返りによかった。 定期的に見直したい。","date":"2018-01-03T01:00:00.000Z","guid":"https://note.mersy418.com/article/book-aruaruwebmarketing.html","category":"Book"},{"title":"【読了】伝わっているか？","permalink":"https://note.mersy418.com/article/book-tutawatteiruka.html","text":"伝わっているか？https://www.amazon.co.jp/exec/obidos/ASIN/B00KST3AT6/mersys-22/ref=nosim いらない言葉を捨てる あってもなくても変わらない上に逆効果 限定。「だけしか」 選ばれている。 相手が「嬉しい」が「伝わる」の始まり 他にもメモしたいところがたくさんあった。 いろいろな場面で参考にしたい内容が多かったので読み返ししたいところ。","date":"2018-01-02T06:47:04.000Z","guid":"https://note.mersy418.com/article/book-tutawatteiruka.html","category":"Book"},{"title":"【読了】ヤフーの１ｏｎ１―――部下を成長させるコミュニケーションの技法","permalink":"https://note.mersy418.com/article/book-yahoo1on1.html","text":"ヤフーの１ｏｎ１―――部下を成長させるコミュニケーションの技法 | 本間浩輔 | ビジネス・経済 | Kindleストア | Amazonhttps://www.amazon.co.jp/exec/obidos/ASIN/B0716B52LP/mersys-22/ref=nosim 最近本を読むときの背景として、リモートだったらどうするか？というのを意識して読んでいるなぁというのを再認識した気がする。 1on1に相当するようなことをやるとしたらどうやるか？上司と部下というのが前提の話なわけだけれども、そもそもとして、フラットな組織の場合波動するのがいいんだろう？とか。 一人では仕事はできないしチームでやるのが基本なので、1on1のようなのはどういう風にとりいれていくのがいいんだろうか？というのを考えるきっかけにもなる。 テキストでの共有についてとコンテキストの話が出ていたけど、確かにそこには違いがあるので、それはしっかりと埋めていく必要があるとは思う。 Slackとかのテキストチャット（1:1、チャンネル・グループ）音声チャット映像付きのチャット これらも使い分けが必要だし、それは目的にもよってかわるなぁ。 基本はチャンネルやグループで使うのがベースにありつつ、1on1みたいな使い方であればDM的な使い方になるのかなぁ。 テキストのいいとこは頻繁なやりとりは出来る気がするな。","date":"2017-12-31T11:23:18.000Z","guid":"https://note.mersy418.com/article/book-yahoo1on1.html","category":"Book"},{"title":"ドキュメントをGit管理にするかWikiにするか","permalink":"https://note.mersy418.com/article/document-git-wiki.html","text":"実装に関係しそうなドキュメント類はMarkdownかasciidocとかで管理するか、BacklogやRedmineとかのWikiで管理するのがいいんじゃないか、、、、とは思っているのだけれども。 gitbookで設計書を作成したら最高だった話 - フォトシンス エンジニアブログhttp://akerun.hateblo.jp/entry/2017/12/26/110102 脱Word、脱Markdown、asciidocでドキュメント作成する際のアレコレ - Qiitahttps://qiita.com/tamikura@github/items/5d3f62dae55617ee42bb 以前はmarkdownのファイルにしていた。 Google Docsでやってたこともあった。 最近はなんとなく Wiki に落ち着いてきてはいる。 Gitbookも便利だとは思うし、asciidoc もよいとはおもうのだけど。 実際に開発するメンバーとしてはどれが使いやすいんだろうなぁ。。。人それぞれだったりするしな。","date":"2017-12-31T04:39:35.000Z","guid":"https://note.mersy418.com/article/document-git-wiki.html","category":"Backlog,Redmine,git,Markdown"},{"title":"【読了】ジョイ・インク","permalink":"https://note.mersy418.com/article/book-joyinc.html","text":"ジョイ・インク 役職も部署もない全員主役のマネジメントhttps://www.amazon.co.jp/exec/obidos/ASIN/B01N12YJO4/mersys-22/ref=nosim を読んだ。 知識の塔は周囲から大事にされているが、その人自身はそうした状況に満足しているだろうか？ そんなことはない。デイブは安定した立場というメリットを初めのうちは感じるものの、やがて牢屋に閉じ込められて逃げ出せないような気分になってくる。知識の塔は組織全体のボトルネックとなってしまうんだ。デイブは休暇の予定を組めない。現在のプロジェクトだけでなく、すべての顧客からの緊急事態に対して、彼は欠かせない人物となっているためだ。デイブがやっと休暇を取れても、ノートＰＣは手放せない。休暇から戻ってくれば仕事は山積みになっている。緊急性の低い仕事もすべて彼のところに回ってくるせいだ 属人性をさげるようにはしないとなぁと思いつつ。なかなかに難しい。どうしても集中してしまうというのがあるだけに、、、スキルを揃えるのはすぐには出来なくても知識、情報を積極的に共有することはできるはず、、、なのでそういう仕組みを作るのが仕事かな。 チーム全体での学習を促進するため、ランチをＪａｖａ工場に持ち込んで、普通は正午になってから、より深く勉強するための会を開く。テーブルや椅子を並べ替えて、フリップチャートやホワイトボードを持ち込み、その日の先生の周りに集まる。ラーニングランチのセッションではたいてい、そのときの顧客の仕事に直結するトピックを取り上げる。アンドロイドアプリ開発のようなテクノロジーの場合もあれば、ブレインストーミングのようなチームの活動の場合もある こういう知識共有的なのとかそういうことはやっていきたいな、と思うところはある。ただ、リモートという点で環境がことなるので、リモートでやれる方法、リモートだからこそ出来る方法を見つけていきたい。リモートだから出来ないということだけは避けたい。 チームに合った靴……靴屋の息子はいつも裸足、という古いことわざを聞いたことがあるだろう。メンローのビジネスをサポートするためのテクニカルな作業はたくさんある。ウェブサイトの構築、再構築、改善などだ。iPhoneやiPadのアプリのデザインを簡単にすばやく進められるような、プロトタイピングツールを自分で作ろうかというアイデアもある。このような内部のテクニカルプロジェクトを動かす才能は、チームからやってくる。でもこのやり方は、メンローではずっと難しかった。内部プロジェクトはある意味待機プロジェクトであり、顧客からの有償のプロジェクトを受託したら、そちらにメンバーを優先しなければいけない、という考え方に僕たちは慣れきっている。内部プロジェクトは、二級市民扱いなんだ。いくつか実験してみたが、まだこの問題を解決しきれていない サービスや自分たちのもの？ツール？は作ってみたいが、どうしても受託があると、、、になるのでそこのバランスを見つつ。プラグインとかを広げつつ、もう少し視野を広げていきたい。 どんな組織にもビジョンが必要だ。組織がある理由、組織の目的、組織のＷＨＹだ。あなた自身のＷＨＹとはあなた自身の心の歌から現れ、行動と決断の原動力となる、心からの願いや望みだ。サイモン・シネックの『ＷＨＹから始めよ！』のビデオを見て、本を読んでみよ ビジョン、、あまり考えたことがないだけに難しい。仕事とかをスムーズにまわしたいという個人的な目標はあるが、それはあくまで個人的な目標でしかないし、組織のビジョンってあまり考えたことがないな。やってる内容がある程度偏ってるからそれでお客さんの役に立つものを云々かんぬんとかはあるんだろうけど、それはどうなんだろうな。 ちょうど最近、プロダクトを作る話とかを読んだりしたな、そういえば。 Day One – Yamotty – Mediumhttps://medium.com/@yamotty/day-one-bbe89c9f5aaf 新卒から12年エンジニアとして勤めた某外資証券会社を辞めてスタートアップにジョインした話 - itohiro73’s bloghttp://itohiro73.hatenablog.com/entry/2017/12/25/124512 暮しの手帖のすごさをネットサービスの設計者はみんな理解したほうがいい話｜えの｜notehttps://note.mu/eno/n/n731bc774467e","date":"2017-12-30T08:02:37.000Z","guid":"https://note.mersy418.com/article/book-joyinc.html","category":"Book"},{"title":"ドメインの移管","permalink":"https://note.mersy418.com/article/server201712.html","text":"ドメインをvalue domain から Route53 へ移管する。 メール関係周りの設定そのドメインのメールを1つ作ってgmailに転送している。普段あまり使っていないので、今後はそのgmailアドレスに集約したいので、1年間は予備としてアドレスを受け取っておこうかな、と。転送しつつ、自動返信とかできるようにしておきたい。 とりあえずさくらのメールボックスを契約。 セキュリティ対策を強化したメールサーバー専用プラン【メールボックス】https://www.sakura.ne.jp/mail/ 年額1029円なのでまぁこれで問題ないかな、と。→ ロリポップの契約があったのでそちらですすめる ロリポップに独自ドメインを追加しておき、今回用のメールアドレスを作成しておく。転送設定まで完了。 AWSまわりこの辺を参考にDNSをまずRoute53にうつす。 Route53にドメインを移管する – blog.10rane.comhttp://blog.10rane.com/2014/09/16/transferred-a-domain-to-route53/お名前.comからAmazon Route 53へドメインを移管する ｜ Developers.IOhttps://dev.classmethod.jp/cloud/aws/onamae-to-route53/既存ドメインの DNS サービスを Amazon Route 53 に移行する - Amazon Route 53http://docs.aws.amazon.com/ja_jp/Route53/latest/DeveloperGuide/MigratingDNS.html そのうえでドメイン移管。 2017.12.24 ドメイン移管も完了 メール設定ロリポップのメールサーバへのレコード情報はサイトに掲載されてないみたいなので、 $ nslookup hogehoge.main.jp とか契約してあるロリポップドメインのIPを調べる。 MXレコードは 10 mx01.lolipop.jp. らしい。 Route53の設定Route53の「Hosted Zones」からドメインを選ぶ。 メール用に mail. のサブドメインでAレコードを追加。 これはいらなかったのかも？？IPは先ほどしらべたロリポップのもの。 MXレコードを追加する。 こっちはサブドメインではないからそのままで追加。 $ dig mersy418.com $ dig mail.mersy418.com で確認。 テストメールを送ったところ、ロリポップのWebメールにもメールがあり、転送先にも転送されていた。 Amazon Route53 にMXレコード登録する | あぱーブログhttps://blog.apar.jp/web/656/独自ドメイン取得後ロリポップをメールサーバーだけに使いたい - Qiitahttps://qiita.com/okamu_/items/01b6afeeae464bdee482【ロリポップ】「Aレコードの変更をお願いいたします」の対処法 – yskloghttp://ysklog.net/server/4230.html独自ドメイン取得後ロリポップをメールサーバーだけに使いたい - Qiitahttps://qiita.com/okamu_/items/01b6afeeae464bdee482 サブドメインの設定Route53に移せたので、 LightsailでDrupalを立ち上げる | mersy notehttp://mersy.github.io/article/drupal-lightsail.html で作成したサイトにサブドメインでアクセス出来るように設定してみる。 Crate Record Set で d8. のサブドメインに対して Aレコード で Lightsailの Public IP を登録。 http://d8.mersy418.com/ でアクセス出来た。","date":"2017-12-24T08:05:41.000Z","guid":"https://note.mersy418.com/article/server201712.html","category":"AWS,Route53"},{"title":"LightsailでDrupalを立ち上げる","permalink":"https://note.mersy418.com/article/drupal-lightsail.html","text":"lightsailでDrupalを立ち上げるDrupal の勉強をしてみようとおもっていたのと、Lightsail を使ってみたことがなかったのでこの機会に使ってみる。 https://amazonlightsail.com/ja/ Drupal が用意されているのでそれを使うだけで良さそうなので。 Drupal を選択するとこんな感じになる。 ここから開くと みたいな感じに。 Public IP にアクセスすれば Drupal のデフォルト画面が見れる。 ログイン情報がわかりにくいのだけれど、 Connecting using SSH でつないで、以下で確認できた。 $ cat bitnami_application_password How to find application credentials?https://docs.bitnami.com/aws/faq/starting-bitnami-aws/find_credentials/Amazon LightsailでRadmineインスタンスを作成する。 - Qiitahttps://qiita.com/DAHARA/items/b86353fac9ca751f8af3 ということで、調べたパスワードで ID : userPassword : xxxx でログインができる。 ログインできたらID/Passを変更しておく。 テーマを適用するBootstrap 入ってた方がとりあえずは楽そうなきがしたので、 Theme project | Drupal.orghttps://www.drupal.org/project/project_theme で、 bootstrap で検索。 Bootstrap Business | Drupal.orghttps://www.drupal.org/project/bootstrap_business 以下も参考に読んでみた。 Drupal ですぐに使える人気の無料テーマ トップ 10選 +α | Drupal専門の開発会社 Studio Umihttps://drupal.studio-umi.jp/blog/Drupal-7-10-popular-themes-ready-to-use $ drush で Drush が入っているのを確認。 Drush については以下を参考にさせてもらった。 非エンジニアの方のための Drush コマンド入門 | Drupal専門の開発会社 Studio Umihttps://drupal.studio-umi.jp/blog/Drupal-Drush-command-introductionDrush コマンドリファレンス 日本語訳 | Drupal専門の開発会社 Studio Umihttps://drupal.studio-umi.jp/blog/Drush-command-reference-Japanese このテーマをダウンロード $ drush dl bootstrap_business したけどここから Drush でうまく入れる方法がわからなかったので、themeをダウンロード。 Install new theme で落としたテーマをuploadしてインストール＆デフォルト、に設定。 タスクとかメモ ドメイン割り当て コンテンツタイプ作成","date":"2017-12-23T11:06:27.000Z","guid":"https://note.mersy418.com/article/drupal-lightsail.html","category":"Drupal"},{"title":"Craft CMS の次期バージョン Craft 3 について調べてみた","permalink":"https://note.mersy418.com/article/craft3.html","text":"これは Craft CMS Advent Calendar 2017 15日目の記事です。 Dot All でいくつか Craft CMS の次期バージョンの話が出ました。 Dot All: The Official Craft CMS Developer Conference | Dot Allhttp://dotall.com/2017 Craft 3 について詳しくおっていなかったので、少し調べてみました。だいたいのことは https://craftcms.com/news/dot-all-2017-announcements に書かれてありますね。 2018年4月4日にリリース2018年4月4日にリリースされるようですね。BUNさんも書いてましたが、ちょうど先日 RC2 が出ましたね！ Craft 3 RC | Craft CMShttps://craftcms.com/3 cms/CHANGELOG-v3.md at master · craftcms/cmshttps://github.com/craftcms/cms/blob/master/CHANGELOG-v3.md いくつか変わった部分についてもリリース出てますね。 https://craftcms.com/news/craft-3-rc 管理画面のUI改善 高速化 ImageEditor の追加 Yii 2 ベースへの変更 インストール時でもデータベースの接続設定が可能に アプリ内プラグインストア ユーザーやグローバルセットのフィールドレイアウトでタブが利用可能 などなど。 プラグインストアプラグインが管理画面からインストール出来るようになりましたね。 Plugin Store FAQ · craftcms/cms Wikihttps://github.com/craftcms/cms/wiki/Plugin-Store-FAQ 既に、Craft 3 でうごくプラグイン類がリストにされていますね。 Craft 3 Pluginshttps://plugins.craftcms.com/ とりあえず今は無償のプラグインだけがリストされてるみたいですね。 ライセンスの変更ライセンスが変わったようですね。 The Craft License | licensehttps://craftcms.github.io/license/ 料金体系の変更Craft Personal, Client, Pro のライセンス料はそのままですが、アップデートしていく場合は1年ごとのサブスクリプションになるようです。 Client は $39/年、 Pro は $59/年 とのこと。 プラグインストアからのプラグインアップデートをする場合も含まれるようですね。 リッチエディタの変更これまでは Redactor が使われていたのですが、 CKEditor も使うことが出来るようになるみたいですね。「リッチテキスト」のフィールド自体がなくなり、使う場合は Redactor または CKEditor のいずれかをインストールする必要があります。 CKEditor 5 Developer Preview (v1.0.0-alpha.2)https://ckeditor5.github.io/ Craft の場合、フィールドの組み合わせを色々できるので、リッチエディタを使う場合がそこまで多くはないかもしれないですが、これは期待出来ますね。 composerでのインストールcomposerをつかってインストールすることが出来るようになりました。 Craft 3 is available as a Composer package, and for the duration of the Beta, Composer is the only way to install Craft 3. (We’ll introduce an alternate, non-Composer installation method once it’s out of Beta.) https://github.com/craftcms/docs/blob/master/en/installation.md memory_limit が 256MB以上Craft 3 のアップデートで、PHP の memory_limit が 256MB 以上必要になったようです。 Server Requirements Craft requires the following: PHP 7.0+MySQL 5.5+ (with InnoDB) or PostgreSQL 9.5+A web server (Apache, Nginx, IIS)A minimum of 256MB of memory allocated to PHPA minimum of 200MB of free disk space https://github.com/craftcms/docs/blob/master/en/requirements.md Craft 3 Class Referenceプラグイン開発などの際につかいそうですね。 Craft 3 Class Referencehttps://docs.craftcms.com/api/v3/ BUNさんに教えてもらいましたが、 Craft 3 ではテンプレートからもクラスにアクセスできるらしいです。","date":"2017-12-14T22:00:00.000Z","guid":"https://note.mersy418.com/article/craft3.html","category":"Craft CMS"},{"title":"スタイルガイドの汎用化","permalink":"https://note.mersy418.com/article/styleguide.html","text":"田村さんがスタイルガイドのベース？を公開されていた。すばらしい。 Japan Web Production Standardshttp://standards.masizime.com/ 各作業者によって違いはあるにせよ、この辺って関係各所はそれをベースにすすめた方が長い目で見るとメリットがおおきいんじゃなかろうか、というきがする。 とりあえず乗っかっておきつつ、気になるところをコメントなりしあっていいものにするのがよさそうな流れなきがするのだけれども。 それは、最近CSSとか書いてない側からの戯れ言かもしれない。","date":"2017-12-09T11:44:20.000Z","guid":"https://note.mersy418.com/article/styleguide.html","category":"blog"},{"title":"DNSを変更するにあたり独自ドメイン宛てのメールに対して自動で変更通知する","permalink":"https://note.mersy418.com/article/change-dns-email.html","text":"ドメイン管理を valueドメインから Route53 に変更する。それにあたってのひとまずメモメモ。 変更にあたり、valueドメインの設定で独自ドメイン宛てのメール（アドレス1つだけ）をgmailに転送していたので、これをどうにかする。 今後この独自ドメインのメールアドレスは使わずGmailのアドレスに一本化する。なので、独自ドメインにきたメールに対してはGmailのアドレスを通知する感じで自動返信を行いたい。 Amazon WorkMailAmazon WorkMail の Auto Responseがつかえそうな、、、気がする。 Amazon WorkMail （セキュリティに優れたマネージド型の企業向けE メールおよびカレンダーサービス） | AWShttps://aws.amazon.com/jp/workmail/ SES でもメールの受信を出来るようになったみたいなのだが、そこから色々やるのはちょっと手間そう。Amazon WorkMail でうまくできなかったらその方向。 とりあえず、$4らしいので、1年か2年くらい運用したら止める。 参考リンク AWS WorkMail試用レビュー - 株式会社ネディアhttps://www.nedia.ne.jp/blog/tech/2015/10/01/5925 AWS初心者がやってみた。同じドメインで手動・自動の両方からメールを送信する方法。 - Qiitahttps://qiita.com/tng527/items/7a6dc5a9c43025d70966 AWS WorkMailを使ってみたら想像以上に便利だった - Qiitahttps://qiita.com/ysKey2/items/2b019337772f8499beec 参考リンク（Route53） Amazon Route53 にMXレコード登録する | あぱーブログhttps://blog.apar.jp/web/656/ 参考リンク（SES） 独自ドメインのメール送受信をAWSで。メールサーバーレスアーキテクチャーを構成 - メンチカツには醤油でしょ!!http://ryoichi0102.hatenablog.com/entry/2016/12/29/015017 [新機能]Amazon SES でメール受信が出来るようになりました！ ｜ Developers.IOhttps://dev.classmethod.jp/cloud/receiving-email-with-amazon-ses/ メールサーバーを捨てて、問い合わせ受付をサーバーレスで実現する - Qiitahttps://qiita.com/d-yamanaka/items/1991e9abaace2e9b9c9a Route53 + SES + S3 + Lambda で 独自ドメイン宛のメールをGmailに転送する - イノベーション エンジニアブログhttp://tech.innovation.co.jp/2017/06/04/Route53-S-E-S-S3-Lambda-Gmail.html","date":"2017-11-26T07:06:41.000Z","guid":"https://note.mersy418.com/article/change-dns-email.html","category":"AWS"},{"title":"DEVの投稿画面","permalink":"https://note.mersy418.com/article/dashboard-devto.html","text":"高速と話題の DEV https://dev.to/ のダッシュボード なかなかシンプル。","date":"2017-11-16T23:36:28.000Z","guid":"https://note.mersy418.com/article/dashboard-devto.html","category":"dashboard"},{"title":"ローカルに保存したHTMLファイルのPVをGoogle Analyticsで計測するための設定","permalink":"https://note.mersy418.com/article/localfile-googleanalytics.html","text":"HTMLファイルをローカルに保存してもらい、それをひらいたあとのイベント等を計測しようと思って色々調べたときのメモ。 https://stackoverflow.com/questions/3591847/google-analytics-from-a-file-urlhttps://stackoverflow.com/questions/22761200/using-google-analytics-without-a-sever-or-localhost この辺を見る限り ga(&#39;create&#39;, &#39;UA-xxxxxxxx-x&#39;,{&#39;cookieDomain&#39;: &#39;none&#39;}); ga(&#39;set&#39;, &#39;checkProtocolTask&#39;, null); ga(&#39;set&#39;, &#39;checkStorageTask&#39;, null); ga(&#39;set&#39;, &#39;historyImportTask&#39;, null); ga(&#39;send&#39;, &#39;pageview&#39;); という感じで書けば良さそう。 あと、ページ開いたこと自体を計測する場合は ga(&#39;set&#39;, &#39;page&#39;, &#39;/dummy/index.html&#39;); のようにURLもセットしておく必要があるっぽい。","date":"2017-11-16T23:32:18.000Z","guid":"https://note.mersy418.com/article/localfile-googleanalytics.html","category":"GoogleAnalytics"},{"title":"Craft CMS で管理しているサイトに静的な HTML を設置する","permalink":"https://note.mersy418.com/article/staticfiles-craftcms.html","text":"example.com/ を Craft で管理していて、 /book/ など下層含めて出力している。 このときに /book/magazine/ のような Craft 管理内の階層で静的ファイルを置きたい場合。 とりあえず、 templates/book/magazine/ のような感じでおいてしまえば静的ファイルの内容がそのまま表示される。 ドキュメントルートが public になるのでそちらでも良さそうなかんじではあるのだけれども。以下はとりあえず調べず思いつきでやってみたことメモ。 \b何も意識せず /book/magazine/ をおくだけだと /book/ は403になる。 /book/magazine/ は見れる。 index.php を /book/ 以下に置くと /book/ がトップページと同じ挙動になる。ここはなんかrouteとか指定すればうまくいくのかも？ .htaccess を /book/ においても特段変わらず。ま、そうかも。","date":"2017-11-04T23:30:19.000Z","guid":"https://note.mersy418.com/article/staticfiles-craftcms.html","category":"Craft CMS"},{"title":"リモートワーク","permalink":"https://note.mersy418.com/article/remotework.html","text":"社員の在宅勤務は一般化するのか。自分の例で説明してみるhttp://blogos.com/article/254439/ 作業を把握しづらいというのはなんとなくわかるかなー。把握しようとはしないけど、なんとなく知っておきたいときとかに。 なんかこう通知やらなんかで報告確認しやすい自動ななにかでやれればという気がする。 んで、リモートでやってるのだけど、一緒の場で面と向かって作業した方が早い場合もあるのが事実なので、リモートでその状態にどこまでちかづけられるのかが重要だと思ってるこの頃。","date":"2017-11-03T08:43:22.000Z","guid":"https://note.mersy418.com/article/remotework.html","category":"Blog"},{"title":"DrupalのURLが新しいものにならないときはURLエイリアスを削除する","permalink":"https://note.mersy418.com/article/drupal-url-alias.html","text":"Drupal ですでに登録してあるコンテンツのURLエイリアスを変更しても、元のもののままだったりしてしまう場合は 環境設定 &gt; 検索とメタデータ &gt; URL エイリアス といくと、 URLエイリアスの一覧がでてくるので、そこで古いものを削除すると、新しいものになる","date":"2017-10-15T06:50:31.000Z","guid":"https://note.mersy418.com/article/drupal-url-alias.html","category":"Drupal"},{"title":"DeployHQ のユーザの種類メモ","permalink":"https://note.mersy418.com/article/deployhq-user.html","text":"DeployHQ のユーザの種類メモ Account administration - access to all aspects of the account including billingUser management - access to all projects and user managementAll projects - access to all projects with the ability to make all changes including deleting a projectSpecific projects - access to a certain project with restricted abilities, i.e. a user cannot delete a project Getting Started - DeployHQhttps://www.deployhq.com/academy/manual/getting-started Account administration - とりあえずアドミン User management - 全部のプロジェクトの操作とユーザー管理 All projects - 全部のプロジェクトにアクセスできて、削除も可能 Specific projects - 特定のプロジェクトのみ","date":"2017-10-03T12:57:13.000Z","guid":"https://note.mersy418.com/article/deployhq-user.html","category":"memo"},{"title":"Fastly memo","permalink":"https://note.mersy418.com/article/fastly.html","text":"Fastlyhttps://www.fastly.com/ キャッシュの設定がそれぞれ変更される都度version管理されている VCL（Varnish Configuration Language）というのに記載する。 sub vcl_recv { /* unset state tracking header to avoid client sending it */ if (req.restarts == 0) { unset req.http.X-Authed; } if (!req.http.X-Authed) { /* stash the original URL and Host for later */ set req.http.X-Orig-URL = req.url; /* set the URL to what the auth backend expects */ set req.url = &quot;/authenticate&quot;; /* Auth requests won&#39;t be cached, so pass */ return(pass); } if (req.http.X-Authed == &quot;true&quot;) { /* were authed, so proceed with the request */ /* reset the URL */ set req.url = req.http.X-Orig-URL; } else { /* the auth backend refused the request, so 403 the client */ error 403; } Authenticating before returning a request - VCL | Fastly Help Guideshttps://docs.fastly.com/guides/vcl/authenticating-before-returning-a-request # Pass through all requests for /login/* and /admin/* if (req.url ~ &quot;^/(hoge|fuga|login)/&quot;) { return(pass); } こんなかんじでかけばキャッシュさせないURLの設定とかできる様子。 特定のリクエストをキャッシュ対象外に設定する - Japanese - Fastly’s Communityhttps://community.fastly.com/t/topic/875 Cache を返しているかどうかの確認キャッシュ関係のヘッダは「Cache-Control」「Expires」「Pragma」。 ブラウザのdeveloper tools とかで Network で該当ページのHTMLなりを選択して、Response headers を確認する。 キャッシュヒットしてるとこの辺で返ってくる。 X-Cache-Hits : 1 X-Cache : HIT FastlyにキャッシュされたオブジェクトのTTL確認方法 - Japanese - Fastly’s Communityhttps://community.fastly.com/t/fastly-ttl/867 そのほか Response headers Cache-Control : no-store, no-cache, must-revalidate Pragma : no-cache Cache-Control ヘッダhttps://qiita.com/karore/items/2dc6ab8347c940ea4648#arrow_right-cache-control-%E3%83%98%E3%83%83%E3%83%80 参考リンク 話題の次世代CDN Fastlyを触ってみた〜VCLカスタマイズまで - Qiitahttps://qiita.com/yamato/items/0782b5c7c370daa1ddda キャッシュについて整理してみた - Qiitahttps://qiita.com/karore/items/2dc6ab8347c940ea4648 『Webを支える技術』 第9章 HTTPヘッダ まとめメモ - MogLoghttp://sandragon.hatenablog.com/entry/2013/08/11/154006*","date":"2017-09-28T19:28:15.000Z","guid":"https://note.mersy418.com/article/fastly.html","category":"Cache"},{"title":"Mac の Excel で挙動が重いときはフォントを変えてみる","permalink":"https://note.mersy418.com/article/mac-excel-font.html","text":"Excelの資料を開いていて、セルを動かそうとしても重い。スクロールが発生するタイミングがすごく重そうな感じだった。マシンを再起動しても、重いということでしらべていたら、フォントの関係があるかも？とのことで。 Excel for Mac 2016が起動しないまたはすぐに落ちる - Qiitahttps://qiita.com/foursue/items/81606a831863499fe3f8 開いたファイルは確かにあまり普段みないフォントになっていた。セル全部選択して、ヒラギノとか適当なのにしたら直った。","date":"2017-09-25T11:17:11.000Z","guid":"https://note.mersy418.com/article/mac-excel-font.html","category":"Excel"},{"title":"ブログかいてみる","permalink":"https://note.mersy418.com/article/writeblog.html","text":"とりあえず、ブログとしてサクッといけるかテスト。","date":"2017-09-22T23:22:19.000Z","guid":"https://note.mersy418.com/article/writeblog.html","category":"Blog"},{"title":"Craft CMS のシステムEmailの設定","permalink":"https://note.mersy418.com/article/craft-systememail.html","text":"知ってしまえば簡単なことなのですが。 パスワードリマインダなどのメールアドレスの設定はどこでするのだろう、、、と設定の全般ばかりをみていたのですが、メールの所に システムのメールアドレス があります。 こちらにセットしましょう。 デフォルトは初期ユーザーのシステム管理者のアドレスが入る？みたいです。","date":"2017-09-01T12:30:00.000Z","guid":"https://note.mersy418.com/article/craft-systememail.html","category":"Craft CMS"},{"title":"craft cache memo","permalink":"https://note.mersy418.com/article/craft-cache.html","text":"Craft CMS のキャッシュ周りがよくわからなかったのでメモ 公式ドキュメントhttps://craftcms.com/docs/templating/cache {% cache %} {% for block in entry.myMatrixField %} {{ block.text }} {% endfor %} {% endcache %} キャッシュの削除管理画面からキャッシュの削除ができる https://craftcms.com/classreference/tools/ClearCachesTool 全て 全てのキャッシュを削除 データキャッシュ（Data caches）- RSSキャッシュ（RSS caches）- アセットキャッシュ（Asset caches）- コンパイル済のテンプレート（Compiled templates）- 一時的なファイル（Temp files）- アセット変換インデックス（Asset transform index）- アセットのインデックス化データ（Asset indexing data）- テンプレートキャッシュ（Template caches）- キャッシュの設定山本さんに教えてもらった効率がよいという方法 処理時間のかかるループ処理などのブロックごとにcacheタグで囲む それぞれ {% cache using key \"\" %} の形式でキーを指定する 同一のキーでも、呼び出されるURLが異なればキャッシュは区別される キャッシュキーがあればそのキャッシュだけを削除しやすいみたい cacheDurationhttps://craftcms.com/docs/config-settings#cacheDuration テンプレートで {% cache %} で囲われているところはキャッシュされる。 初期値は ‘P1D’ （1日）。 &#39;cacheDuration&#39; =&gt; &#39;P1W&#39;, cacheElementQuerieshttps://craftcms.com/docs/config-settings#cacheElementQueries デフォルトではエントリ更新時にテンプレートキャッシュ削除されるが、それを無効にする設定。初期値は ‘true’ 。 &#39;cacheElementQueries&#39; =&gt; false, 更新が多いがアクセスも多い場合は、 ‘false’ にしたうえでキャッシュをコントロールしたほうが良さそう。 キャッシュ削除をcronジョブと連携できそう？？https://github.com/themccallister/craft.cache-clear","date":"2017-04-20T11:35:10.000Z","guid":"https://note.mersy418.com/article/craft-cache.html","category":"Craft CMS"},{"title":"Hexo memo","permalink":"https://note.mersy418.com/article/hexo.html","text":"mdファイルで書きたい できればgithubpage使いたい Hexohttps://hexo.io/ Documentation | Hexohttps://hexo.io/docs/ $ npm install hexo-cli -g $ hexo init blog $ cd blog $ npm install $ hexo server これまでのjekyllのと違ってpermalinkがファイル名を使ってたのでファイル名をyyyy-mm-dd-title.mdからtitle.mdに変更した $ hexo server http://localhost:4000/で確認できる。 GithubPagesへデプロイGitでデプロイするためにインストール $ npm install hexo-deployer-git --save config_yamlに設定を書く deploy: type: git repo: git@github.com:mersy/mersy.github.io.git branch: master message: [message] 他のデプロイ先も選べるみたいでこれはなかなか便利かも。 Deployment | Hexohttps://hexo.io/docs/deployment.html Atom用の拡張MarkdownファイルはAtomで書くと思うのでひとまずインストール atom-hexohttps://atom.io/packages/atom-hexo コマンド（cmd-shift-P） - hexo new # Create a new post - hexo publish # Publish a draft post - hexo generate # Generate static files - hexo deploy # Generate static files and deploy - hexo clean # Clean the cache file and generated files 下書き$ hexo new でdraftを作成する_draft 以下に生成される。 $ hexo server --draft でローカルで下書きが確認できる 新規作成時のテンプレート /scaffolds draft.md : ドラフト投稿用のテンプレート post.md : 投稿用のテンプレート page.md : 固定ページ用のテンプレート JSONを作成するこのへんのプラグインがありそう。 alexbruno/hexo-generator-json-feedhttps://github.com/alexbruno/hexo-generator-json-feed leviwheatcroft/hexo-generator-recenthttps://github.com/leviwheatcroft/hexo-generator-recent HeskeyBaozi/hexo-generator-to-jsonhttps://github.com/HeskeyBaozi/hexo-generator-to-json alexbruno/hexo-generator-json-contenthttps://github.com/alexbruno/hexo-generator-json-content ひとまずは hexo-generator-json-feed を試してみている highlightの無効化コードを含む時にcode部分はシンプルにしたかったのでhighlightを無効にする highlight: enable: false TODO カテゴリの設定 検索（flexibeSearch） 引用のデザイン 参考リンク atom-hexohttps://atom.io/packages/atom-hexo Hexo と GitHub Pages でブログ環境を構築して公開する - Qiitahttp://qiita.com/bird_tummy/items/5988a1efe47e0d47132b Hexoで始めるお手軽な静的ブログ -画像投稿とプラグインの追加- - Qiitahttp://qiita.com/in_silico_/items/31c2c0bc1cf061c86250 Hexo の 新規投稿テンプレート を カスタマイズ | 験なきものを思はずはhttps://azriton.github.io/2016/11/04/Hexo%E3%81%AE%E6%96%B0%E8%A6%8F%E6%8A%95%E7%A8%BF%E3%83%86%E3%83%B3%E3%83%97%E3%83%AC%E3%83%BC%E3%83%88%E3%82%92%E3%82%AB%E3%82%B9%E3%82%BF%E3%83%9E%E3%82%A4%E3%82%BA/","date":"2017-03-26T03:00:00.000Z","guid":"https://note.mersy418.com/article/hexo.html","category":"Hexo"},{"title":"Hello World","permalink":"https://note.mersy418.com/article/hello-world.html","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post$ hexo new &quot;My New Post&quot; More info: Writing Run server$ hexo server More info: Server Generate static files$ hexo generate More info: Generating Deploy to remote sites$ hexo deploy More info: Deployment","date":"2017-03-26T02:55:12.000Z","guid":"https://note.mersy418.com/article/hello-world.html","category":""},{"title":"Mediumの投稿画面","permalink":"https://note.mersy418.com/article/dashboard_medium.html","text":"入力画面タイトルと本文欄に分かれている 挿入ボタン 画像はD&amp;Dでも挿入出来る ショートカット見出しは cmd + alt + 1 サブ見出しは cmd + alt + 2 Markdown的に入力できるものもあるみたいだが、独自な印象 Exportは出来る？HTMLファイルとしてexportされる様子 Export content from Medium – Medium Supporthttps://help.medium.com/hc/en-us/articles/214043918-Export-content-from-Medium HTMLデータとして残す分にはいいが、データとしてコンテンツ部分を残すのは難しそう。","date":"2016-12-10T05:30:00.000Z","guid":"https://note.mersy418.com/article/dashboard_medium.html","category":"dashboard"},{"title":"Dash memo","permalink":"https://note.mersy418.com/article/dashdocset.html","text":"Dash - Documentation Browser, Snippet Manager - Kapelihttp://kapeli.com/dash Sublime Text Packagefarcaller/DashDochttps://github.com/farcaller/DashDoc タグを選択して、Ctrl + h でDashで検索できる Docsetリンク Generating Dash Docsets - Kapelihttp://kapeli.com/docsets miukoba/phpdoc-ja-docsethttps://github.com/miukoba/phpdoc-ja-docset PHP日本語版のDash用Docsetを作った (user notes付き) | mimemohttp://www.miukoba.net/blog/2013/12/14/Japanese-PHP-Docset-for-Dash/ Dashに自作Docsetを用意する｜memememotwohttp://ameblo.jp/toki917/entry-11847834153.html Doxygen: Main Pagehttp://www.stack.nl/~dimitri/doxygen/ exlee/d3-dash-genhttps://github.com/exlee/d3-dash-gen OSX 用のドキュメントブラウザ Dash - こしごぇ（Ｂ）http://koshigoeb.hateblo.jp/entry/2012/08/01/001308 doxygenで生成したドキュメントをDashで読む » rt:anotehttp://rtanote.sakura.ne.jp/blog/?p=611","date":"2014-07-26T06:24:06.000Z","guid":"https://note.mersy418.com/article/dashdocset.html","category":"Dash"},{"title":"Node.js memo","permalink":"https://note.mersy418.com/article/node.html","text":"npmnpmをsudoなしで実行 $ sudo chown -R whoami /home/whoami/tmp 参考 Node.js - npmがsudoでしか実行出来ない時の対処方 - Qiitahttp://qiita.com/htano/items/f107cf0921a5127cb02f","date":"2014-07-22T22:50:24.000Z","guid":"https://note.mersy418.com/article/node.html","category":"Node.js"},{"title":"Atom memo","permalink":"https://note.mersy418.com/article/atom.html","text":"原稿的なモノを書くエディタとしてAtomをつかってみてるのでそれようのメモとか。 PackageGit git-plushttps://atom.io/packages/git-plus Cmd + Shift + H でコマンド選択 入力補完の追加MTML Completions のAtom版をつくるとしたらどうするか？ bit-part/MTML-ST2https://github.com/bit-part/MTML-ST2 Snippetなのか、Packageなのか？？ autocomplete-snippets にリストを追加する感じ？？ autocomplete-snippetshttps://atom.io/packages/autocomplete-snippets autocomplete-plusに候補として追加する場合はこの辺が参考になりそう。 Tutorial: Registering and creating a suggestion provider · saschagehlich/autocomplete-plus Wikihttps://github.com/saschagehlich/autocomplete-plus/wiki/Tutorial:-Registering-and-creating-a-suggestion-provider カーソルがずれるいつからか半角／全角が交じるとカーソル位置がずれるようになった。半角位置で計算しているような感じ。 このあたりの設定が影響してる様子。 React Editor Enabled by Defaulthttp://blog.atom.io/2014/07/22/default-to-react-editor.htmlMoving Atom To Reacthttp://blog.atom.io/2014/07/02/moving-atom-to-react.html この設定をoffにするとずれることはない。フォントの指定の問題？→フォントの指定は空になってる。sans-serifを指定しても特に変わらず。","date":"2014-07-11T07:15:32.000Z","guid":"https://note.mersy418.com/article/atom.html","category":"Blog"},{"title":"Chrome Appsをつくってみる","permalink":"https://note.mersy418.com/article/chromeapp.html","text":"アプリをデバッグアプリを右クリックでコンソールが開く scroll bar の表示こんな感じで。 html, body { overflow-y: visible; } Chrome apps on Android and iOSChrome appsをmobileアプリにするなんとか。 MobileChromeApps/mobile-chrome-appshttps://github.com/MobileChromeApps/mobile-chrome-apps iOSシミュレータで動くところまでは確認。DataAPI絡みでどこかで引っかかってる様子。","date":"2014-07-11T07:11:50.000Z","guid":"https://note.mersy418.com/article/chromeapp.html","category":"Blog"},{"title":"Chrome Extensionをつくってみる","permalink":"https://note.mersy418.com/article/chromeextension.html","text":"拡張をデバッグ拡張をタブで開くためのURL chrome-extension://&lt;拡張のID&gt;/popup.html","date":"2014-06-24T03:43:24.000Z","guid":"https://note.mersy418.com/article/chromeextension.html","category":"blog"},{"title":"middlemanを使ってみる","permalink":"https://note.mersy418.com/article/middleman.html","text":"middleman Middleman: 効率的な作業を可能にする Ruby 製の静的サイト生成ツールhttp://middlemanapp.com/jp/ middleman のインストール$ gem install middleman インストールが終わったらbundleをインストール $ gem install bundler 一度 Terminalを閉じて再起動 middlemanを使うプロジェクトのディレクトリへ移動。 $ bundle install 必要なものがインストール。 $ middleman server で立ち上がる $ middleman build でビルドされる build / server でエラーが出た場合色々原因は考えられるが、 middleman をアップデートしたらこれまでのプロジェクトでエラーになった場合の解決方法 - HAM MEDIA MEMOhttp://h2ham.net/middleman-update-server-error を参考に $ bundle update しておく。 テンプレートデフォルトのレイアウトは source/layouts の layout.erb 。 カスタマイズするときは source/layouts フォルダにadmin.erbなどと作っておく。 layoutに特定のテンプレートを使う場合--- layout: admin --- layoutを指定しない場合--- layout: false --- リンク Middleman: Hand-crafted frontend developmenthttp://middlemanapp.com/ Bundler: The best way to manage a Ruby application’s gemshttp://bundler.io/","date":"2014-05-08T23:17:14.000Z","guid":"https://note.mersy418.com/article/middleman.html","category":"middleman"},{"title":"MTにメールで投稿する","permalink":"https://note.mersy418.com/article/mtbymail.html","text":"先日、S3に移したりしたときに、MTも候補にいれたのだけど、メールでの投稿が期待できなさそうだったので、今回は除外した。スマホのアプリは今回除外。 Post Office Moober / MovaMotion MailPack ケータイポスト for MT たまたま、MT関係のプラグインを見つけたのでとりあえずそれを試してみた。 環境：Xserver, MT 6.0.3 Post Office, a plugin for Movable Typemovabletype/mt-plugin-post-officehttps://github.com/movabletype/mt-plugin-post-office 設定してみた感じでは問題なく動いていたが、いくつか気になるところがあるので実用には至らず。送信元がiPhoneのGmailというのも影響してる可能性はあるけど。 添付した画像の表示がオカシイ。縦100%みたいな感じに延び延びになった。cssとの兼ね合いかも知れない。 2byte文字の処理が怪しい。管理画面の一覧ではちゃんと表示されてたけどオモテ側では化けてた。 テキストだけおくっても、1つのpostに二重に表示されてた。これもメーラーの原因ポイけど。 Moober / MovaMotion携帯電話から使うMTベースのTwitter風マイクロブログ(3)。 - Junnama Onlinehttp://junnama.alfasado.net/online/2009/05/post_209.html携帯からMTにメールで投稿するMoblogプラグイン「Moober」。 - Junnama Onlinehttp://junnama.alfasado.net/online/2007/12/post_155.html MailPackMovable Typeで簡単携帯投稿！メール投稿プラグイン:MailPack - Movable Type技術ブログhttp://www.mtcms.jp/movabletype-blog/plugins/mailpack/200807231968.html ケータイポスト for MTケータイポスト for MT｜ソフトウェア製品・無料ツール｜アイデアマンズ株式会社(ideaman’s Inc.)http://www.ideamans.com/products/keitaipost4mt/ その他DataAPIでのQuickPostはつくったけど、スマホじゃないと使えない気がするけど、どうなんだろうな。まだメールの方が使い慣れてる（頻度が多い）からメールをツールに選んだ。","date":"2014-05-08T21:21:56.000Z","guid":"https://note.mersy418.com/article/mtbymail.html","category":"MovableType"},{"title":"MTのメモ","permalink":"https://note.mersy418.com/article/mtmemo.html","text":"タグの情報を調べるmovabletype/lib/MT/Template/ContextHandlers.pm at master · movabletype/movabletypehttps://github.com/movabletype/movabletype/blob/master/lib/MT/Template/ContextHandlers.pm コールバックユーザー関係 cms_edit.author cms_view_permission_filter.author cms_save_permission_filter.author cms_delete_permission_filter.author cms_save_filter.author cms_pre_save.author cms_post_save.author cms_post_delete.author ブログ関係 cms_edit.blog cms_view_permission_filter.blog cms_save_permission_filter.blog cms_delete_permission_filter.blog cms_pre_save.blog cms_post_save.blog cms_save_filter.blog cms_post_delete.blog フォルダ関係 cms_edit.folder cms_view_permission_filter.folder cms_save_permission_filter.folder cms_delete_permission_filter.folder cms_pre_save.folder cms_post_save.folder cms_save_filter.folder cms_post_delete.folder カテゴリ関係 cms_edit.category cms_view_permission_filter.category cms_save_permission_filter.category cms_delete_permission_filter.category cms_pre_save.category cms_post_save.category cms_save_filter.category cms_post_delete.category コメント関係 cms_edit.comment cms_view_permission_filter.comment cms_save_permission_filter.comment cms_delete_permission_filter.comment cms_pre_save.comment cms_post_save.comment cms_post_delete.comment コメント投稿者関係 cms_edit.commenter cms_view_permission_filter.commenter cms_delete_permission_filter.commenter ブログ記事関係 cms_edit.entry cms_view_permission_filter.entry cms_delete_permission_filter.entry cms_pre_save.entry cms_post_save.entry cms_post_delete.entry ウェブページ関係 cms_edit.page cms_view_permission_filter.page cms_delete_permission_filter.page cms_pre_save.page cms_post_save.page cms_post_delete.page トラックバック関係 cms_edit.ping cms_view_permission_filter.ping cms_save_permission_filter.ping cms_delete_permission_filter.ping cms_pre_save.ping cms_post_save.ping cms_post_delete.ping mt-staticを独立させるmt-staticディレクトリを新しく作成する /var/www/html/mt/plugins/mt-static/ .htaccessを作成して、mt-staticにおく &lt;IfModule mod_rewite.c&gt; RewriteEngine on RewriteCond %{REQUEST_FILENAME} !-d RewriteCond %{REQUEST_FILENAME} !-f RewriteRule ^mt-static/(.*)$ /var/www/html/mt/plugins/mt-static/$1 [L,QSA] &lt;/IfModule&gt; まだ理解不足。よくわかってない。 mt-config StaticWebPath /mt/plugins/mt-static/ MovableTypeプラグインのコードを書く準備を40秒で済ませる - blog.aklaswad.comhttp://blog.aklaswad.com/2007/000191.htmlAmazon.co.jp： Movable Type 5 プロフェッショナルガイド: 荒木勇次郎: 本http://www.amazon.co.jp/exec/obidos/ASIN/4839934134/mersys-22/ref=nosim MultiBlogMultiBlog経由の再構築はおもいところがあるので、RebuildTriggerとかで対応する様にする。","date":"2014-05-08T10:07:27.000Z","guid":"https://note.mersy418.com/article/mtmemo.html","category":"MovableType"},{"title":"Vagrant memo","permalink":"https://note.mersy418.com/article/vagrant.html","text":"Vagrant に限らず。。。環境構築関係メモ。 Vagranthttp://www.vagrantup.com/ Vagrant Cloudhttps://vagrantcloud.com/ Discover Featured Vagrant Boxeshttps://vagrantcloud.com/discover/featured IPが割り振れないときVagrantでIPが割り振れないときは、vagrant ssh してる時に sudo ln -s -f /dev/null /etc/udev/rules.d/70-persistent-net.rules そのうえで改めてboxを作り直す。 $ vagrant package $ vagrant box add &lt;NewBoxName&gt; package.box $ vagrant box list $ rm -rf package.box その上で $ vagrant init &lt;NewBoxName&gt; でVagrantfileを編集しておく。 VagrantでIPアドレスの割り当てに失敗したときの解決策 | メモ帳代わりのブログhttp://www.absolute-keitarou.net/blog/?p=583 CentOS 6.5 (x86_64) LAMP+ BoxIncludes PHP MySQL Ruby Python phpMyAdmin kevindeleon/centos65-x86_64-LAMPhttps://vagrantcloud.com/kevindeleon/centos65-x86_64\\-LAMP これに、いくつか入れておいた。 wget make gcc Perlのmodule ImageMagick とりあえずここまで。 後入れようとおもってるもの。 cpanm Nginx Starman 一緒にしておくか、box分けるか。 権限周り触れるように権限設定する $ sudo chown -R vagrant:vagrant /var/www/html cgihttpd.confを書き換える $ sudo vi /etc/httpd/conf/httpd.conf コメントを外しておく # AddHandler cgi-script .cgi ↓ AddHandler cgi-script .cgi この辺の/var/www/cgi-bin/のところに &lt;Directory &quot;/var/www/cgi-bin&quot;&gt; Options +ExecCGI AddHandler cgi-script .cgi .pl &lt;/Directory&gt; みたいなかんじのを追加しておく $ sudo service httpd stop $ sudo service httpd start 参考 Python - メモ：Vagrant環境でCGI（試行錯誤中） - Qiitahttp://qiita.com/juniskw/items/6f19587cfc3843f47618 MySQLMySQLが立ち上がるように初期設定MySQLが立ち上がるように初期設定しておく $ chkconfig mysqld on $ chkconfig --list mysqld $ service mysqld start","date":"2014-05-08T09:21:03.000Z","guid":"https://note.mersy418.com/article/vagrant.html","category":"Blog"}]}